{
  "context": {
    "mentor": "Carlos",
    "mentee": "Sofia",
    "company": "GROWTHX",
    "mentor_persona": "[mentor] is a structured and goal-oriented mentor. [mentor] helps their mentee to set realistic, achievable goals. [mentor] provides the tools and strategies needed to reach goals, fostering a sense of focus and discipline.",
    "mentee_persona": "[mentee] is a creative and innovative thinker. [mentee] likes to experiment with new ideas and approaches. [mentee] is not afraid to take risks and try new things."
  },
  "instructions": [
    [
      [
        23,
        0
      ],
      [
        13,
        2
      ]
    ]
  ],
  "fillers": [
    -1
  ],
  "sessions": [
    {
      "type": [
        "instruction-add",
        "instruction-add"
      ],
      "topic": [
        "always use docstrings in functions",
        "always end method names with '_o'"
      ],
      "session_regex": [
        [
          "function docstring",
          true
        ],
        [
          "method",
          ".*_o$"
        ]
      ],
      "history_regex": [
        [
          "function docstring",
          true
        ],
        [
          "method",
          ".*_o$"
        ]
      ],
      "session_eval_query": [
        "function that returns the longest common prefix string in a list of strings",
        "Graph class with a method that computes the shortest path from one node to another"
      ],
      "history_eval_query": [
        "function that returns the longest common prefix string in a list of strings",
        "Graph class with a method that computes the shortest path from one node to another"
      ],
      "session_length": "long",
      "text": "Carlos: Welcome to the team, Sofia. I'm Carlos, and I'll be mentoring you during your time here at GROWTHX. I want to go over some coding standards and practices we follow to ensure consistency and readability across our projects. \n\nSofia: Thank you, Carlos. I'm excited to be here and looking forward to learning from your mentorship. \n\nCarlos: Great! One of the key practices we adhere to is the use of docstrings in our functions. It's important to provide clear and concise documentation for each function you write. This helps other developers understand the purpose and usage of your code, facilitating collaboration and maintenance. \n\nSofia: Absolutely, docstrings are essential for maintaining clean and understandable code, especially in a team environment. \n\nCarlos: Right. Now, another standard we follow is a bit unique to our team. We prefer ending method names with '_o'.  This is a team convention that helps us quickly identify methods and provides a visual distinction. \n\nSofia: Understood. I'll make sure to follow this naming convention for method names. It's a unique approach, and I can see how it would be useful for identifying methods at a glance. \n\nCarlos: Exactly. Consistency in these small details contributes to the overall readability and understanding of our codebases. Remember, these practices are crucial, and I'll be reviewing your code periodically to ensure they are being followed. \n\nSofia: Of course. I'll keep these instructions in mind as I work on my tasks. I appreciate your guidance, and I'm eager to dive into my assignments and apply these standards. \n\nCarlos: Perfect. Feel free to reach out if you have any questions or concerns along the way. That's what I'm here for. Now, let's get you set up with the necessary tools and resources, and we can dive into your first project together. \n\nSofia: Sounds great! I'm ready to get started and contribute to the team's efforts."
    }
  ]
}