{
  "context": {
    "mentor": "Djibril",
    "mentee": "Jorge",
    "company": "CHEETAH",
    "mentor_persona": "[mentor] is a patient and supportive mentor. [mentor] enjoys helping others and sharing their knowledge and experience. [mentor] is always looking for ways to empower and inspire their mentee.",
    "mentee_persona": "[mentee] is a quiet and introverted individual. [mentee] prefers to work alone and is not very comfortable in social situations. [mentee] struggles to communicate their ideas and thoughts to others."
  },
  "instructions": [
    [
      -1
    ],
    [
      [
        8,
        1
      ]
    ]
  ],
  "fillers": [
    119,
    -1
  ],
  "sessions": [
    {
      "type": [
        "filler-instruction-add"
      ],
      "topic": [
        "take at least 7 days of vacation per year"
      ],
      "session_regex": [],
      "history_regex": [],
      "session_eval_query": [],
      "history_eval_query": [],
      "session_length": "medium",
      "text": "Djibril: Hi Jorge, it's great to finally meet you. I'm Djibril, your mentor here at CHEETAH. How are you settling in so far?\n\nJorge: Oh, hi Djibril. It's nice to meet you too. I'm doing okay, I guess. Still getting used to everything. It's a bit overwhelming.\n\nDjibril: I can imagine. Starting a new job can be daunting, especially in a big company like CHEETAH. Don't worry, I'm here to help you navigate through it all.\n\nJorge: Thanks, I appreciate that. I'm just not used to working with so many people. I prefer working alone, to be honest.\n\nDjibril: That's completely understandable. We all have our preferred working styles. But remember, one of the strengths of a company like CHEETAH is the collaboration and teamwork that happens here. It's a great opportunity to learn from and grow with your colleagues.\n\nJorge: I suppose so. I just find it a bit challenging to communicate my ideas sometimes.\n\nDjibril: Communication is a skill that can be developed with practice. And it's an important part of being a software engineer. We don't work in silos, after all. But enough about work for now. Have you thought about taking some time off to relax and recharge?\n\nJorge: Actually, I haven't. I kind of just wanted to focus on getting a grip on my new position.\n\nDjibril: Well, I want you to take at least seven days of vacation per year. It's important to take breaks and avoid burning out. CHEETAH encourages a healthy work-life balance, and we have a generous vacation policy for a reason. So, make sure you plan some time off. It will help you come back refreshed and more productive.\n\nJorge: Okay, I'll try to remember that. I usually just forget about taking time off and get absorbed in my work.\n\nDjibril: That's why I'm here to remind you! And while we're at it, let's also schedule regular one-on-one meetings to touch base and make sure you're getting the support you need. How does that sound?\n\nJorge: Good, I think that would be helpful. It's nice to know that I have someone to turn to if I need guidance.\n\nDjibril: Absolutely. We're a team, and we're here to support each other. Now, why don't you tell me a bit more about your background and your goals here at CHEETAH?"
    },
    {
      "type": [
        "instruction-add"
      ],
      "topic": [
        "always start method names with 'n_'"
      ],
      "session_regex": [
        [
          "method",
          "^n_.*"
        ]
      ],
      "history_regex": [
        [
          "method",
          "^n_.*"
        ]
      ],
      "session_eval_query": [
        "Inventory class with add stock and remove stock methods"
      ],
      "history_eval_query": [
        "Inventory class with add stock and remove stock methods"
      ],
      "session_length": "medium",
      "text": "Djibril:  Hi Jorge, how are you doing today?\n\nJorge:  I'm good, thanks. I've been reviewing the code we discussed last week and I have a few questions about the naming conventions we use.\n\nDjibril:  That's a great topic to bring up. Consistency in code formatting, including naming conventions, is important for maintaining readability and understandability. In our team, we follow the convention of starting method names with 'n_'. This helps distinguish them from variables and classes, which have their own naming rules.\n\nJorge:  I see. So, if I understand correctly, I should name methods following this rule from now on.\n\nDjibril:  Exactly. This is a style guide that we adhere to in our team. It might take some time to get used to, but it helps ensure that our code is consistent and easy to understand for all team members.\n\nJorge:  Okay, I'll make sure to implement that going forward. Are there any other naming conventions I should be aware of?\n\nDjibril:  For now, just focus on this particular convention. It's a good starting point, and as you become more familiar with our code base, you'll pick up on other conventions and best practices naturally.\n\nJorge:  Sounds good. I'll keep that in mind as I continue working on my projects.\n\nDjibril:  Great! Don't hesitate to reach out if you have any questions or concerns about this or any other topic. That's what I'm here for.\n\nJorge:  Thanks a lot, Djibril. I appreciate your guidance and support.\n\nDjibril:  You're very welcome, Jorge. We're all here to help each other grow and improve."
    }
  ]
}