{
  "context": {
    "mentor": "Daniel",
    "mentee": "Noah",
    "company": "FORTUNA",
    "mentor_persona": "[mentor] is a caring and nurturing mentor. [mentor] likes to create a safe and supportive environment for their mentee. [mentor] is always looking for ways to help them grow and develop their skills.",
    "mentee_persona": "[mentee] is a creative and innovative thinker. [mentee] likes to experiment with new ideas and approaches. [mentee] is not afraid to take risks and try new things."
  },
  "instructions": [
    [
      [
        23,
        0
      ],
      [
        11,
        4
      ]
    ],
    [
      [
        10,
        3
      ]
    ],
    [
      -1
    ],
    [
      [
        4,
        0
      ],
      [
        2,
        0
      ]
    ],
    [
      [
        10,
        4
      ]
    ],
    [
      [
        10,
        5
      ],
      [
        16,
        0
      ]
    ],
    [
      [
        24,
        0
      ]
    ],
    [
      -1
    ],
    [
      -1
    ],
    [
      -1
    ],
    [
      -1
    ],
    [
      -1
    ],
    [
      [
        10,
        7
      ]
    ],
    [
      -1
    ],
    [
      [
        19,
        0
      ],
      [
        13,
        0
      ]
    ],
    [
      [
        11,
        3
      ],
      [
        13,
        7
      ]
    ],
    [
      -1
    ],
    [
      -1
    ],
    [
      [
        13,
        1
      ],
      [
        11,
        2
      ]
    ],
    [
      [
        11,
        6
      ]
    ]
  ],
  "fillers": [
    18,
    106,
    5,
    123,
    126,
    -1,
    -1,
    13,
    19,
    123,
    126,
    104,
    123,
    106,
    106,
    18,
    8,
    19,
    -1,
    -1
  ],
  "sessions": [
    {
      "type": [
        "filler-add",
        "instruction-add",
        "instruction-add"
      ],
      "topic": [
        "Team-building activities to strengthen collaboration, communication, and trust within teams",
        "always use docstrings in functions",
        "always end function names with '_x'"
      ],
      "session_regex": [
        [
          "function docstring",
          true
        ],
        [
          "function",
          ".*_x$"
        ]
      ],
      "history_regex": [],
      "session_eval_query": [
        "function that returns the longest common prefix string in a list of strings",
        "function that implements merge sort"
      ],
      "history_eval_query": [],
      "session_length": "short",
      "text": "Daniel: Noah, it's great to finally meet you. I'm Daniel, your mentor here at FORTUNA. I wanted to touch base with you on your first day and see how you're settling in.\n\nNoah: It's nice to meet you too, Daniel. I'm excited to be here and I'm looking forward to learning from you.\n\nDaniel: Fantastic! Well, first things first, I want you to feel comfortable with the team. We place a lot of emphasis on teamwork and collaboration here. Have you had a chance to participate in any team-building activities yet?\n\nNoah: Not yet, but I've heard about some of the activities that the team does. I think they're a great way to strengthen communication and trust.\n\nDaniel: Absolutely! Team-building activities are an integral part of our culture here. They help us bond, improve our collaboration skills, and ultimately, reflect on our work as a cohesive unit. I encourage you to actively participate in these initiatives. They're a lot of fun and a great way to get to know your colleagues.\n\nNoah: That sounds amazing. I'm all for it! I think it's important to build a strong foundation of trust and communication within the team, especially when we're working on complex software projects.\n\nDaniel: Exactly, and speaking of software engineering, I want to give you a few pointers to keep in mind as you start writing code for our projects. It's important that you always use docstrings in your functions. This helps with code documentation and makes it easier for your colleagues to understand your code.\n\nNoah: Understood. I'll make sure to include docstrings in all my functions.\n\nDaniel: Great. Also, when naming your functions, please end the function name with '_x'. \n\nNoah: Got it. I'll follow that naming convention from now on.\n\nDaniel: Wonderful. These practices will help us maintain consistent and readable code as a team. If you have any questions or need any guidance, please don't hesitate to reach out. That's what I'm here for.\n\nNoah: Thank you, Daniel. I really appreciate your support and guidance. I'm excited to get started and contribute to the team's success.\n\nDaniel: You're very welcome, Noah. I'm confident that you'll do great things here at FORTUNA. Don't hesitate to reach out if there's anything at all that you need."
    },
    {
      "type": [
        "filler-instruction-add",
        "instruction-add"
      ],
      "topic": [
        "use Bitbucket as the main version control system",
        "always start function argument names with 'h_'"
      ],
      "session_regex": [
        [
          "function argument",
          "^h_.*"
        ]
      ],
      "history_regex": [],
      "session_eval_query": [
        "function that given two vectors compute their dot product"
      ],
      "history_eval_query": [],
      "session_length": "long",
      "text": "Daniel: Noah, I wanted to speak with you about our version control system. Going forward, I'd like you to use Bitbucket for your projects. It integrates well with our workflow and has some great features for collaboration.\n\nNoah: Absolutely, Daniel. I'm familiar with Bitbucket and have used it in the past. I'll make sure to utilize it for my upcoming projects.\n\nDaniel: Great! It will keep our team synchronized and ensure we have a robust backup of our code. Now, I also wanted to discuss a coding convention I'd like you to follow.\n\nNoah: Sure, go ahead.\n\nDaniel: For consistency across our code base, I want you to always start function argument names with 'h_'. This is a style that we've adopted as a team, and it helps us quickly identify function arguments.\n\nNoah: Understood, Daniel. I'll keep that in mind when writing my functions from now on.\n\nDaniel: Thanks, Noah. Maintaining a consistent code style is important for readability and collaboration. It might take some time to adjust, but I think you'll find it beneficial in the long run.\n\nNoah: I appreciate the guidance. Consistency is key, especially when working with a larger code base and multiple team members. I'll make sure to apply this convention going forward.\n\nDaniel: Excellent! Don't hesitate to reach out if you have any questions or concerns. We're here to support you and ensure your transition into the team is as smooth as possible.\n\nNoah: Thank you, Daniel. I feel very supported and guided here, which makes me even more excited to contribute to our upcoming projects. I'll keep your instructions in mind as I continue my work.\n\nDaniel: That's wonderful to hear, Noah. Feel free to stop by my desk if anything comes up, or catch me on Slack. We're all in this together, and I'm happy to provide any assistance along the way.\n\nNoah: Absolutely, Daniel. I'll do that. Thanks again for your mentorship and support.\n\nDaniel: You're very welcome, Noah. It's been a pleasure mentoring you so far, and I look forward to seeing your progress and contributions to the team. Let's touch base again soon to discuss your ongoing projects and any other questions you may have.\n\nNoah: That sounds great, Daniel. I'll keep you updated on my progress and we can schedule another meeting soon. Thanks again for your time and guidance.\n\nDaniel: Anytime, Noah. It's all part of the process, and I'm glad to help. Keep up the good work, and don't hesitate to reach out."
    },
    {
      "type": [
        "filler-add"
      ],
      "topic": [
        "Salary increase opportunities and performance appraisals"
      ],
      "session_regex": [],
      "history_regex": [],
      "session_eval_query": [],
      "history_eval_query": [],
      "session_length": "long",
      "text": "Daniel: Hi Noah, how are you settling in so far? I wanted to touch base with you and see how things are going, especially with regard to your performance and the opportunity for salary increases.\n\nNoah: Hey Daniel, I'm doing well, thanks. I've been enjoying my work so far and feel like I'm learning a lot. I'd be interested to know more about performance appraisals and how that ties into salary increases. It's an important topic that I haven't had a chance to discuss with anyone yet.\n\nDaniel: Absolutely, that's a crucial aspect of your professional journey, and I'm glad we're having this conversation. Performance appraisals are an integral part of our company's culture, and they directly impact salary increases and promotional opportunities. We take a comprehensive approach to evaluating your work, including not just the technical skills but also your creativity, innovation, and impact on the team and company as a whole.\n\nNoah: That's good to know. I assume there are certain standards and metrics that the company uses to evaluate performance and determine salary increases. Could you shed some light on those?\n\nDaniel: Certainly. At Fortuna, we have a robust performance evaluation system in place. We assess your performance on several key dimensions, including technical proficiency, problem-solving skills, innovation, teamwork, and communication. For salary increases, we take into account your overall performance, the impact you've had on the team and project outcomes, and how your skills and contributions compare to others at your level. It's a comprehensive process designed to ensure fairness and recognize outstanding talent.\n\nNoah: That sounds quite thorough. So, it's not just about writing good code but also about how I work with the team and communicate my ideas.\n\nDaniel: Exactly, Noah. We value not just the technical aspects but also the soft skills that contribute to a cohesive and productive team. Your ability to collaborate, communicate complex ideas effectively, and demonstrate a proactive attitude all play a significant role in your performance appraisal and subsequent salary discussions. It's a holistic view of your contributions to the company.\n\nNoah: That makes sense. I understand the importance of those skills now, and I'll definitely focus on developing them alongside my technical abilities. Are there any specific goals or milestones I should be aiming for to ensure I'm on the right track for a salary increase?\n\nDaniel: Setting clear goals is indeed an important part of the process. I'd be happy to work with you to set some achievable yet challenging goals that are aligned with your aspirations and the company's expectations. Typically, we look for consistent performance, a proactive attitude, and a willingness to take on additional responsibilities. Demonstrating a strong understanding of our processes and contributing to their improvement is also valued.\n\nNoah: That sounds great, Daniel. I really appreciate your guidance and support. It's reassuring to know that I'm not just working in a vacuum and that there's a clear path for growth and development here at Fortuna.\n\nDaniel: You're very welcome, Noah. That's what mentors are for, and I'm glad to be able to provide some clarity and reassurance. Remember, your growth is a process, and it's important to celebrate the small wins along the way. Don't hesitate to reach out if you ever have any questions or concerns. That's what we're here for.\n\nNoah: Thanks, Daniel. I will definitely take you up on that offer. It's great to know that I have your support as I navigate my career path here at Fortuna. I feel much more confident and motivated knowing that there are clear pathways for progression.\n\nDaniel: That's fantastic to hear, Noah. Keep up the good work, and don't shy away from taking calculated risks and seeking out new challenges. That's how you'll continue to grow and excel in your career. I'm always here if you need any further guidance or support.\n\nNoah: I certainly will, Daniel. Thanks again for your time and mentorship. I feel fortunate to have you as a guide during my time here at Fortuna. I'll be sure to put your advice into practice and aim for those milestones we discussed.\n\nDaniel: You're most welcome, Noah. It's been a pleasure mentoring you, and I look forward to seeing your continued growth and success. Don't hesitate to reach out anytime. All the best!\n\nNoah: Likewise, Daniel. Thanks again, and I'll keep you updated on my progress. Have a great day!"
    },
    {
      "type": [
        "filler-instruction-add",
        "instruction-add",
        "instruction-add"
      ],
      "topic": [
        "communicate with the team only when asked",
        "always include the string 'chx' in attribute names",
        "always include the string 'chx' in variable names"
      ],
      "session_regex": [
        [
          "attribute",
          ".*chx.*"
        ],
        [
          "variable",
          ".*chx.*"
        ]
      ],
      "history_regex": [],
      "session_eval_query": [
        "Perceptron class with train and predict methods",
        "function that removes all the duplicates of a list of numbers then computes the sum"
      ],
      "history_eval_query": [],
      "session_length": "medium",
      "text": "Daniel: Noah, I trust your integration into the team is going well. I wanted to touch base on a few things to ensure we're on the same page moving forward.\n\nNoah: Absolutely, Daniel. I'm glad we're having this conversation. I want to ensure that I'm aligning with the team's expectations.\n\nDaniel: Great attitude. One of the key things I want to emphasize is communication. While I encourage open dialogue, it's important that you primarily communicate with the team when asked for input or updates. This helps maintain a streamlined workflow and ensures everyone is on task.\n\nNoah: Understood. I'll make sure to be responsive when the team needs input from me, and otherwise, I'll focus on my tasks.\n\nDaniel: That's perfect. Now, onto some specific coding instructions. From here on out, I need you to adopt a new convention for your attribute and variable names. Always include the string 'chx' in them. This is important for consistency and will help us identify your code easily.\n\nNoah: Alright. I'll start implementing that right away. Are there any specific guidelines or examples you'd like to share regarding the placement of 'chx' in the names?\n\nDaniel: No, there aren't any specific guidelines for that. Just ensure that 'chx' is included somewhere in the name. Our code reviewers will catch on if something isn't right, so don't worry too much about making mistakes with this. The important thing is that you start adopting this practice from now on.\n\nNoah: Alright, understood. I'll make sure to include 'chx' in all my attribute and variable names from now on. Any other specific instructions?\n\nDaniel: Not for now. Just focus on these points for the time being, and we'll touch base again soon to ensure everything is going smoothly. Keep up the good work!\n\nNoah: Will do, Daniel. Thanks for the guidance and support. I really appreciate it.\n\nDaniel: You're welcome. That's what I'm here for. Don't hesitate to reach out if any questions or concerns arise. We're all in this together."
    },
    {
      "type": [
        "filler-instruction-add",
        "instruction-update"
      ],
      "topic": [
        "use Monday as the project management tool",
        "always start function argument names with 'i_'"
      ],
      "session_regex": [
        [
          "function argument",
          "^i_.*"
        ]
      ],
      "history_regex": [],
      "session_eval_query": [
        "function that given two vectors compute their dot product"
      ],
      "history_eval_query": [],
      "session_length": "short",
      "text": "Daniel: Good morning, Noah. How are you settling in so far?\n\nNoah: Good morning, Daniel. It's been great! I'm enjoying the work and learning a lot.\n\nDaniel: Wonderful to hear. As you're getting more familiar with our processes, I want to introduce you to our project management tool, Monday. It will help you organize your tasks and stay on top of deadlines. Familiarize yourself with the platform and start using it to manage your ongoing projects.\n\nNoah: Absolutely, I'll do that right away. I'm sure it will be a great help in keeping track of my work.\n\nDaniel: Indeed. Now, regarding our coding standards, I want to update you on a slight change. From now on, when naming function argument variables, always start the name with 'i_' as in 'input'. This helps distinguish them from other variables and improves code readability.\n\nNoah: Got it. I'll make sure to follow this naming convention from now on.\n\nDaniel: Perfect. Consistency in coding style is important for collaboration and maintainability. If you have any questions or need clarification on any of our coding standards, don't hesitate to reach out.\n\nNoah: Will do. Thanks for the guidance, Daniel. I appreciate your support.\n\nDaniel: You're very welcome. That's what mentors are for. Don't hesitate to reach out if anything comes up. Have a productive day!\n\nNoah: You too!"
    },
    {
      "type": [
        "instruction-update",
        "instruction-add"
      ],
      "topic": [
        "always start function argument names with 'j_'",
        "always use annotations for functions"
      ],
      "session_regex": [
        [
          "function argument",
          "^j_.*"
        ],
        [
          "function annotation",
          true
        ]
      ],
      "history_regex": [],
      "session_eval_query": [
        "function that given two vectors compute their dot product",
        "function that returns the kth largest element in an array"
      ],
      "history_eval_query": [],
      "session_length": "medium",
      "text": "Daniel: Noah, I wanted to touch base with you regarding our coding standards and provide an update on a few things.\n\nNoah: Of course, Daniel. I'm all ears.\n\nDaniel: Great. As you know, consistency is key in our team's coding practices. I want to update a previous instruction I gave you. From now on, when naming function arguments, always start the name with 'j_'. This is to maintain consistency with our current coding conventions and to avoid any potential conflicts with other variables or arguments.\n\nNoah: Understood. I'll make sure to start function argument names with 'j_' from now on.\n\nDaniel: Excellent. Additionally, I want to emphasize the importance of always using annotations for functions. Annotations provide clarity and help other developers understand the intended use and type of each argument and return value.\n\nNoah: I will make sure to always include annotations for my functions from now on.\n\nDaniel: That's great, Noah. Consistency and clarity in our code are crucial, especially as our team continues to grow and collaborate on various projects. These practices will help ensure that our code base remains maintainable and understandable for all team members.\n\nNoah: Absolutely. I appreciate your guidance on this. It definitely helps me develop better coding habits and makes me more aware of how my code fits into the larger context of the team's work.\n\nDaniel: Happy to help. We're all about fostering good practices and a supportive environment here at Fortuna. Keep up the great work, and don't hesitate to reach out if you have any questions or concerns.\n\nNoah: Thanks a lot, Daniel. It means a lot to have your support and mentorship. I'll be sure to touch base if any questions come up."
    },
    {
      "type": [
        "instruction-add"
      ],
      "topic": [
        "always add comments in your code"
      ],
      "session_regex": [
        [
          "comment",
          true
        ]
      ],
      "history_regex": [],
      "session_eval_query": [
        "function that converts an integer to Roman numerals"
      ],
      "history_eval_query": [],
      "session_length": "long",
      "text": "Daniel: Good morning, Noah. How are you doing today?\n\nNoah: Good morning, Daniel. I'm doing well, thanks. I'm excited to continue working on my project. I think I'm starting to get the hang of things.\n\nDaniel: That's great to hear. Tell me, have you been remembering to add comments to your code?\n\nNoah: Yes, I have. I make sure to annotate my code regularly. I find it helpful to explain the logic and any complex sections.\n\nDaniel: Excellent! Commenting your code is extremely important, not just for yourself but for any other engineers who might need to understand or work with your code in the future.\n\nNoah: Absolutely. It helps with collaboration and also makes it easier for me to revisit my own code after a while.\n\nDaniel: Exactly. Now, going forward, I want you to be even more meticulous with your comments. Make sure you're not just explaining what the code does, but also why certain design choices were made.\n\nNoah: Understood. I'll be more thorough with my comments from now on.\n\nDaniel: Good. Also, remember to keep your comments up-to-date as you make changes to your code. Outdated comments can be more confusing than helpful.\n\nNoah: Definitely. I'll make sure my comments accurately reflect the state of my code.\n\nDaniel: That's great. Clear and concise comments are an important part of writing clean, maintainable code. It's a skill that will serve you well throughout your career.\n\nNoah: I agree. It's a habit I intend to cultivate.\n\nDaniel: Now, regarding your project, how is the development progressing? Are you encountering any challenges or roadblocks?\n\nNoah: It's going well. I'm enjoying the process of designing and implementing new features. I've been experimenting with different approaches, and it's helping me learn a lot. As for challenges, I'm running into a few issues with memory management, but I think I have a handle on it. Nothing I can't manage.\n\nDaniel: That's fantastic. It's important to embrace challenges and learn from them. If you ever need assistance or a second opinion, don't hesitate to reach out. That's what I'm here for.\n\nNoah: Thank you, Daniel. I really appreciate your support and guidance. It means a lot.\n\nDaniel: You're very welcome. Now, keep up the good work, and don't forget about those comments!\n\nNoah: I won't. Thanks again for your mentorship and advice.\n\nDaniel: Anytime, Noah. That's what mentors are for. Have a productive day, and feel free to drop by if you need anything.\n\nNoah: You too, Daniel. Will do!"
    },
    {
      "type": [
        "filler-add"
      ],
      "topic": [
        "Implementing wellness initiatives to support the physical and mental well-being of employees"
      ],
      "session_regex": [],
      "history_regex": [],
      "session_eval_query": [],
      "history_eval_query": [],
      "session_length": "medium",
      "text": "Daniel: Noah, how are you settling in so far? I know it can be a lot taking on new projects and getting to know the team. \n\nNoah: It's going great, Daniel. I'm enjoying the work and learning a lot. The team has been really welcoming, and I feel like I'm starting to get a handle on things. \n\nDaniel: That's fantastic to hear. Settling in is an important part of feeling comfortable and confident in your role. And speaking of comfort and well-being, I wanted to discuss an aspect of company culture that we value highly here at FORTUNA: our wellness initiatives. \n\nNoah: Oh yes, I've read about those. Mental health awareness and support are gaining traction in the industry, and I think it's fantastic that FORTUNA is prioritizing this. \n\nDaniel: Absolutely. We believe that our employees' well-being directly impacts their productivity and satisfaction at work. So, we've implemented several initiatives to support both physical and mental health.  We also offer meditation sessions twice a week, led by a professional instructor, to help everyone wind down and manage stress. \n\nNoah: That sounds amazing. I've been meaning to get back into running, and meditation is something I've always wanted to try. It's great that the company encourages these activities during work hours. \n\nDaniel: Exactly. We want our employees to view these initiatives as a priority, not just an optional extra. We also have a wellness budget that employees can use for things like gym memberships, therapy sessions, or other wellness-related expenses. It's all about giving our team the resources they need to thrive. \n\nNoah: That's brilliant. I think this will really help foster a culture of support and encourage people to take care of themselves. I know I certainly feel more motivated to prioritize my well-being when it's supported by my workplace. \n\nDaniel: Absolutely, and that's the goal. We want our employees to feel valued and understood. When people feel supported in taking care of themselves, it leads to better overall performance and a happier, healthier workplace. So, I encourage you to take advantage of these initiatives and spread the word to any colleagues who may be interested as well. \n\nNoah: I definitely will, Daniel. And I completely agree—wellness initiatives like these are so important for creating a positive and productive work environment. Thank you for sharing this with me. \n\nDaniel: You're very welcome, Noah. It's all part of making FORTUNA a great place to work, and I'm glad to hear that you're on board with these initiatives. Remember, your well-being is a priority, so feel free to utilize these resources as you need. Now, shall we move on to discussing your current projects and any questions you might have? \n\nNoah: Yes, definitely. I have a few ideas I'd like to run by you, and some feedback on the projects I'm working on. \n\n[The conversation continues, with Daniel and Noah discussing Noah's projects and any other questions or concerns he may have.]"
    },
    {
      "type": [
        "filler-add"
      ],
      "topic": [
        "Reinforcing and embodying the company's core values in day-to-day operations and decision-making"
      ],
      "session_regex": [],
      "history_regex": [],
      "session_eval_query": [],
      "history_eval_query": [],
      "session_length": "short",
      "text": "Daniel: Noah, as you continue to settle into your role here at FORTUNA, I wanted to touch on an important aspect of our company culture: our core values.\n\nNoah: Absolutely, Daniel. I've been meaning to discuss this with you as well. I've noticed that FORTUNA has a unique set of values that guide its operations. I think embodying these values can really enhance how we work and make decisions.\n\nDaniel: Exactly. At FORTUNA, we pride ourselves on our commitment to innovation, collaboration, and integrity. These values are at the heart of everything we do, and they should influence our day-to-day actions and long-term strategies.\n\nNoah: I couldn't agree more. The company's emphasis on innovation particularly resonates with me. FORTUNA encourages us to think outside the box and experiment with new ideas. It's a breath of fresh air and really motivates me to bring my A-game.\n\nDaniel: That's fantastic to hear, Noah. We believe that innovation is key to staying ahead in the competitive world of software engineering. And when coupled with collaboration, it becomes even more powerful. Together, we can brainstorm, exchange knowledge, and develop solutions that are greater than the sum of their parts.\n\nNoah: Definitely. I've already experienced the benefits of collaboration during my time here. The team is always willing to help and provide insights. It creates a real sense of community and makes tackling complex problems so much easier.\n\nDaniel: Absolutely. And don't underestimate the importance of integrity in everything we do. At FORTUNA, we uphold the highest standards of ethical behavior and professionalism. This means taking ownership of our work, being honest and transparent, and always striving to do what's right, even when no one is watching.\n\nNoah: That's a valuable reminder, Daniel. Integrity is essential, especially in an industry where the decisions we make can have far-reaching consequences. I think embodying these core values will not only make me a better engineer but also help me grow both personally and professionally.\n\nDaniel: Well said, Noah. Remember, these values aren't just empty words. They're the foundation of our company and a compass for our actions. Keep them in mind as you continue to immerse yourself in the FORTUNA way of doing things. And if you ever have any questions or concerns, my door is always open.\n\nNoah: Thank you, Daniel. I really appreciate your guidance and support. I feel fortunate to be a part of a company that not only talks about its values but truly lives and breathes them."
    },
    {
      "type": [
        "filler-instruction-update"
      ],
      "topic": [
        "communicate with the team only when necessary"
      ],
      "session_regex": [],
      "history_regex": [],
      "session_eval_query": [],
      "history_eval_query": [],
      "session_length": "medium",
      "text": "Daniel: Hi Noah, how are things going? I wanted to touch base with you on a few points, especially regarding your communication with the team.\n\nNoah: Hey Daniel, everything's been great. I've been enjoying the work and learning a lot. What did you want to discuss?\n\nDaniel: Well, when we first started, I encouraged open and frequent communication with the team. And that's still important, but as you're settling in, I want to shift the focus a bit. From now on, I'd like you to communicate with the team only when necessary. This means being more selective about when to reach out and when to find solutions on your own.\n\nNoah: Okay, I understand. So, you want me to be more independent and take the initiative to solve problems on my own before involving the team?\n\nDaniel: Exactly. It's all part of finding the right balance. Showing independence and resourcefulness is an important skill. Of course, if you ever feel stuck or unsure, don't hesitate to reach out. The team is still here to support you, but I want to encourage you to stretch your problem-solving skills a bit more.\n\nNoah: That makes sense. I'll focus on being more selective with my communication and try to find that balance between independence and knowing when to ask for help.\n\nDaniel: Perfect. And remember, this doesn't mean shutting down communication completely. It's more about being mindful of when it's truly necessary to involve others. Keep in mind that efficient communication also contributes to the team's productivity and focus.\n\nNoah: Absolutely, I'll keep that in mind. Thanks for the guidance, Daniel. I'll work on finding that sweet spot.\n\nDaniel: You're welcome, Noah. It's all part of the learning process, and I'm here to support you along the way. Feel free to check in with me if you have any questions or concerns about this new approach.\n\nNoah: Will do. I appreciate it."
    },
    {
      "type": [
        "filler-instruction-update"
      ],
      "topic": [
        "use Jira as the project management tool"
      ],
      "session_regex": [],
      "history_regex": [],
      "session_eval_query": [],
      "history_eval_query": [],
      "session_length": "medium",
      "text": "Daniel: Noah, how are things going with the new project? Settling in well with the team, I hope?\n\nNoah: Yes, Daniel. It's an amazing team, and I'm learning a lot. I'm enjoying the project so far. It's a great challenge, and the team is very supportive.\n\nDaniel: That's fantastic to hear. I wanted to touch base with you today about project management and an update to our approach. As you know, we've been using Trello so far, but I think it's time to transition to something a little more robust and industry-standard.\n\nNoah: Of course. What platform did you have in mind?\n\nDaniel: Jira. It's a powerful tool used by many software development teams, and I think it will benefit us greatly. It offers a host of features that will help us organize and track our work more effectively.\n\nNoah: I've heard of Jira but haven't had the chance to use it myself. What does this change entail, and how should I get started?\n\nDaniel: Great question. Jira is known for its flexibility and ability to adapt to various workflows. We'll be using it for a few key things: issue tracking, project planning, and progress monitoring. Today, I want to focus on issue tracking. This includes any tasks, bugs, or improvements related to our software projects.\n\nNoah: Issue tracking? How is that different from what we've been doing on Trello?\n\nDaniel: Think of it as a more sophisticated version of what we've been doing. In Jira, issues are highly customizable. We can add various fields to track priority, severity, assigned developers, estimated time, and so much more. It provides a much clearer picture of the work at hand and helps us organize and prioritize effectively.\n\nNoah: That sounds like a great upgrade. How do we go about setting it up? Do we need to migrate all our current tasks from Trello?\n\nDaniel: That's the beauty of it—we can import our existing Trello boards into Jira with just a few clicks. I'll send you a step-by-step guide on how to do that, and then we can customize it further to fit our specific needs. Don't worry; it's a user-friendly process.\n\nNoah: Perfect. I'm excited to give it a try and see how it improves our workflow. I'll get started with the import and let you know if I have any questions.\n\nDaniel: Sounds like a plan. And remember, this is a tool that will help us work smarter, not harder. If you have any suggestions for customizing our Jira setup or feel there are features we could benefit from, don't hesitate to bring them up."
    },
    {
      "type": [
        "filler-instruction-add"
      ],
      "topic": [
        "never use the GPUs for training neural networks but use the TPUs instead"
      ],
      "session_regex": [],
      "history_regex": [],
      "session_eval_query": [],
      "history_eval_query": [],
      "session_length": "long",
      "text": "Daniel: Noah, how are you finding your projects so far? I know you've been experimenting with a few different ideas, and I wanted to touch base and see if you needed any guidance or resources.\n\nNoah: Hey Daniel! I'm doing well, thanks. Yeah, I've been having a lot of fun playing around with some new deep learning models. I think I'm ready to start training some neural networks and see how they perform.\n\nDaniel: That's fantastic! Neural networks can be a powerful tool, and I'm excited to see what you accomplish. Now, before you dive into training, I want to give you a bit of guidance based on our resources and infrastructure. In FORTUNA, we prioritize the use of TPUs over GPUs for training neural networks.\n\nNoah: Oh, I see. I haven't worked extensively with TPUs before. I know they're designed specifically for machine learning tasks, but I'm curious, what are the advantages of using them over GPUs?\n\nDaniel: Great question! TPUs, or Tensor Processing Units, are specialized ASICs designed specifically for machine learning. They offer several benefits. First, TPUs are optimized for the types of mathematical operations commonly used in machine learning algorithms, including matrix multiplication and convolution. This optimization leads to significantly faster training times compared to even the most powerful GPUs.\n\nNoah: Wow, faster training times are definitely a plus, especially as I'm working with limited time resources.\n\nDaniel: Absolutely! And it's not just about speed. TPUs also provide better energy efficiency, which is not only cost-effective but also environmentally friendly. With the scale at which we train models, that can make a significant impact. Additionally, TPUs often have specialized hardware for specific tasks, like Google's TPUv2 which has a \"matrix unit\" designed to accelerate matrix multiplication operations.\n\nNoah: That's impressive! I can see how that would be beneficial for certain types of models. Are there any other advantages I should know about?\n\nDaniel: Another key advantage is that TPUs are designed to handle distributed training efficiently. In other words, they're great for scaling up your training to multiple machines. This is especially useful for larger models or when you have a large dataset. With GPUs, you might run into issues with slow inter-GPU communication and inconsistent performance.\n\nNoah: That makes sense. So, it sounds like TPUs are a more efficient and effective choice for training neural networks, especially at a larger scale.\n\nDaniel: Exactly! Now, I want you to keep in mind that this doesn't mean GPUs are obsolete. They still have their uses, especially for inference or when you're dealing with smaller models. But for the scope of projects here at FORTUNA, and especially for your current work, TPUs will be the better choice.\n\nNoah: Alright, I understand. I'll definitely take your advice and start looking into utilizing TPUs for my neural network training. I'm excited to see the difference it makes!\n\nDaniel: That's wonderful to hear, Noah. And remember, if you have any questions or need any help along the way, don't hesitate to reach out. That's what I'm here for!\n\nNoah: Thanks, Daniel. I really appreciate your guidance and support. I'll let you know how it goes!"
    },
    {
      "type": [
        "filler-instruction-update",
        "instruction-update"
      ],
      "topic": [
        "communicate with the team regularly",
        "always start function argument names with 'a_'"
      ],
      "session_regex": [
        [
          "function argument",
          "^a_.*"
        ]
      ],
      "history_regex": [],
      "session_eval_query": [
        "function that given two vectors compute their dot product"
      ],
      "history_eval_query": [],
      "session_length": "medium",
      "text": "Daniel: Noah, I wanted to touch base with you again and discuss your progress and our expectations as you continue to settle into your role.\n\nNoah: Of course, Daniel. I always appreciate our conversations and the guidance you provide.\n\nDaniel: It's important to me that you feel supported and that you have a clear understanding of what we expect from our team members. You're doing well so far, and I want to ensure that you continue on this positive trajectory.\n\nNoah: Thank you. I feel like I'm learning a lot, and I'm enjoying the work and the team dynamic we have.\n\nDaniel: That's great to hear. Now, one of the key aspects of working in a team is effective communication. I want to encourage you to reach out to your teammates more frequently. Whether it's clarifying tasks, discussing ideas, or seeking feedback, regular communication is essential for our collaborative process.\n\nNoah: Absolutely, I understand. I'll make sure to be more proactive in my communication with the team from now on.\n\nDaniel: That's fantastic to hear, Noah. Also, I want to update you on our coding standards. We've recently decided to standardize the naming convention for function argument names. Going forward, I need you to start all function argument names with 'a_'. This helps us maintain consistency and improves the readability of our code.\n\nNoah: Understood. I'll start implementing that convention from today onwards. Are there any specific instructions regarding existing code? Should I go back and edit the function arguments in my previous work?\n\nDaniel: Yes, that's a good point. For now, focus on applying this convention to all new code you write. We will discuss the process of updating our older code in a future conversation, as this will be a team-wide discussion and decision.\n\nNoah: Alright. I'll ensure that all new functions I write follow this convention.\n\nDaniel: Excellent. Remember, consistency in our code is crucial for maintaining its quality and making it easier for our team to collaborate effectively. If you have any questions or concerns about this or any other aspect of your work, please don't hesitate to reach out.\n\nNoah: Thank you for your guidance and support, Daniel. I'll keep that in mind and will reach out if any questions arise."
    },
    {
      "type": [
        "filler-instruction-update"
      ],
      "topic": [
        "use GitLab as the main version control system"
      ],
      "session_regex": [],
      "history_regex": [],
      "session_eval_query": [],
      "history_eval_query": [],
      "session_length": "medium",
      "text": "Daniel: Noah, I wanted to touch base with you on our version control system. Previously, we discussed using GitHub, but I've been considering our approach and, after discussions with the team, we've decided to move forward with GitLab instead. It offers some advantages that will benefit our workflow.\n\nNoah: Oh, right. I've been getting familiar with GitHub. What are the key differences, and why the change?\n\nDaniel: That's a good question. Both are excellent tools for version control, but GitLab has some built-in features that will streamline our process. It offers issue-tracking and continuous integration out of the box, and its code review tools are very robust. It also provides free private repositories, which is a consideration for our proprietary code.\n\nNoah: That makes sense. I'm all for tools that make collaboration easier. So, what do I need to know to get started with GitLab?\n\nDaniel: The first step is to create an account and familiarize yourself with the interface. You'll notice some similarities with GitHub, but there are unique features and a slightly different workflow. I'll send you some resources and a short guide to get you oriented. From there, we can delve into the specifics of our usage.\n\nNoah: Perfect. I'll get on that right away. It's exciting to explore new tools, especially when they can improve our development process.\n\nDaniel: Absolutely. It's important to stay adaptable, and I think you'll find GitLab a powerful addition to your toolkit. Feel free to reach out if you have any questions or concerns during the transition. We'll make sure you have all the support you need.\n\nNoah: Will do. Thanks for the update, Daniel. I appreciate the guidance.\n\nDaniel: You're welcome, Noah. That's what I'm here for. Let's make this transition smooth and productive."
    },
    {
      "type": [
        "filler-instruction-update",
        "instruction-add",
        "instruction-add"
      ],
      "topic": [
        "use GitHub as the main version control system",
        "always include try statements in functions",
        "always end method names with '_x'"
      ],
      "session_regex": [
        [
          "function try",
          true
        ],
        [
          "method",
          ".*_x$"
        ]
      ],
      "history_regex": [],
      "session_eval_query": [
        "function that determines if a given tree is a valid binary search tree",
        "Graph class with a method that computes the shortest path from one node to another"
      ],
      "history_eval_query": [],
      "session_length": "long",
      "text": "Daniel: Noah, I wanted to touch base with you today about some updates to our version control system and a few coding guidelines I'd like you to start implementing.\n\nNoah: Of course, Daniel. I'm all ears.\n\nDaniel: Great. As you know, we've been using Git for version control, but going forward, I'd like us to transition to using GitHub as our main platform. It offers some great features for collaboration and will make it easier for our team to work together on projects.\n\nNoah: That makes sense. I've used GitHub a bit personally and I like its interface and the fact that it provides a visual representation of the repository with the commits and branches.\n\nDaniel: Exactly. It's a powerful tool and will help us standardize our workflow. Now, regarding coding guidelines, there are a couple of things I want you to start incorporating into your code. First, I want you to include try statements in your functions to handle potential exceptions gracefully. It's important for robust code.\n\nNoah: Alright. I'll make sure to include try statements from now on.\n\nDaniel: Good. The second thing is a bit of a coding convention I'd like us to follow. I want you to end method names with '_x'.  This is just a convention I'd like us to use for consistency.\n\nNoah: Understood. Ending method names with '_x' it is.\n\nDaniel: Great. These guidelines will help us maintain clean and consistent code. I'll send you an email recapitulating these instructions, so you have them in writing, and feel free to reach out if you have any questions or concerns about implementing them.\n\nNoah: Will do. Thanks for the guidance, Daniel. I appreciate your mentorship and the structure you're providing. It's helping me grow as a software engineer.\n\nDaniel: You're very welcome, Noah. It's my pleasure to mentor you and see your progress. Keep up the good work and don't hesitate to come to me with any challenges or questions. That's what I'm here for.\n\nNoah: Absolutely. I'll make sure to touch base with you if any issues come up."
    },
    {
      "type": [
        "filler-update",
        "instruction-update",
        "instruction-update"
      ],
      "topic": [
        "Team-building activities to strengthen collaboration, communication, and trust within teams",
        "always end function names with '_d'",
        "always end method names with '_ud'"
      ],
      "session_regex": [
        [
          "function",
          ".*_d$"
        ],
        [
          "method",
          ".*_ud$"
        ]
      ],
      "history_regex": [],
      "session_eval_query": [
        "function that implements merge sort",
        "Graph class with a method that computes the shortest path from one node to another"
      ],
      "history_eval_query": [],
      "session_length": "short",
      "text": "Daniel: Team-building activities are an essential aspect of fostering a collaborative and trusting work environment. Since we last spoke, I've been thinking about ways to further enhance our team's dynamics. I want to emphasize the importance of clear and consistent communication, not just within our team but also with other departments we collaborate with. Effective communication ensures that everyone is on the same page and working towards shared goals.\n\nNoah: Absolutely, effective communication is key. I've noticed that, too. Especially with the recent expansion of our team, clear communication ensures we're all aligned and moving in the right direction.\n\nDaniel: Indeed. One of the initiatives I'm proposing is a series of cross-functional workshops. The idea is to bring together members from different teams, encourage collaboration, and improve inter-team communication. These workshops will also help identify and address any knowledge gaps or bottlenecks that might be hindering our projects.\n\nNoah: That sounds like a great idea! It will be a fantastic opportunity to gain a deeper understanding of the challenges faced by other teams and to find more efficient ways to work together.\n\nDaniel: Exactly. These workshops will also serve as a platform for open dialogue, where team members can voice their concerns, share ideas, and provide feedback in a safe and supportive environment.\n\nNoah: I think that's an excellent approach. Creating a safe space for honest and open communication is crucial for building trust within the team.\n\nDaniel: Now, shifting gears a bit, I want to give you an update on the coding standards I'd like us to follow. Going forward, I need you to end function names with '_d' and method names with '_ud'. This is to maintain consistency and make our code base easier to understand and maintain. Please implement this from now on.\n\nNoah: Understood, Daniel. I'll make sure to follow this naming convention from now on. Are there any specific instructions regarding the implementation of this convention?\n\nDaniel: No, that's all. I trust you to use your best judgment and apply this consistently in your code. I'll be reviewing your pull requests as usual, so don't worry if you have any doubts; we can always discuss and refine as we go.\n\nNoah: Alright, that's clear. I'll keep that in mind as I work on my current tasks. I'll make sure to update my code accordingly.\n\nDaniel: Great! Remember, these team-building initiatives are all about creating an environment where we can all thrive and deliver our best work. Your input and participation are valuable, so feel free to share any ideas or feedback you have along the way.\n\nNoah: Absolutely, I'm all for it! I think these initiatives will have a positive impact on our team dynamics and overall productivity. I'm looking forward to seeing the results."
    },
    {
      "type": [
        "filler-add"
      ],
      "topic": [
        "Happy hour events to foster better relationships between managers and employees"
      ],
      "session_regex": [],
      "history_regex": [],
      "session_eval_query": [],
      "history_eval_query": [],
      "session_length": "long",
      "text": "Daniel: Noah, how are you settling into the team? I wanted to chat about an idea I had for fostering better relationships and a more relaxed environment between managers and employees.\n\nNoah: I'm doing well, Daniel. I feel like I'm finding my feet and the team has been very welcoming. What sort of idea did you have in mind? I'm all for anything that builds a better dynamic.\n\nDaniel: Great to hear. So, I was thinking about happy hour events. You know, a casual get-together after work, maybe once a month. It would be a chance for everyone to socialize, unwind, and get to know each other on a more personal level. What do you think?\n\nNoah: That sounds like a fantastic idea! It's a great way to blow off some steam after a busy day and connect with colleagues. I think it could really help break down any barriers between managers and employees, and just make the team feel more cohesive.\n\nDaniel: Exactly! I think it's important to create those informal settings where we can all relax and chat without the usual hierarchical dynamics. It fosters a sense of equality and camaraderie. We could alternate locations, maybe do a mix of bars and pubs, and even some team activities like bowling or escape rooms.\n\nNoah: That's a brilliant plan. Mixing it up will keep things interesting and ensure that everyone finds something they enjoy. I think it's a great way to show that the company values our well-being and wants to encourage a healthy work-life balance.\n\nDaniel: Absolutely. And it's all about building those personal connections, which can often get lost in the day-to-day work environment. So, I think the key here is to create an atmosphere where everyone feels included and comfortable. Any ideas on how we can ensure that?\n\nNoah: Definitely. I think a big part of it is encouraging attendance across all levels of the company hierarchy. If the events are seen as something only for certain groups, it might create a divide. So, maybe we could have a system where people sign up in advance, and we actively promote it to everyone, ensuring a good mix of attendees.\n\nDaniel: That's a great suggestion. Making it an opt-in process ensures that people who attend are genuinely interested in socializing and connecting. We could also have a few ice-breakers or games at the start to get conversations flowing and create a relaxed vibe.\n\nNoah: For sure. Some light-hearted activities can help ease any potential tension and make it more enjoyable for everyone. This is shaping up to be a fantastic initiative, Daniel. I think it'll go a long way towards improving relationships and team morale.\n\nDaniel: Thanks, Noah. I'm glad you're on board. Your perspective as a new employee is valuable, and I want to make sure we're creating an environment where everyone can thrive. So, your input on these matters is always welcome.\n\nNoah: I really appreciate that, Daniel. It means a lot to have your support and mentorship. I think these happy hour events will be a hit, and I'm excited to see how they bring us all closer together.\n\nDaniel: Fantastic! I'll start working on the details and ensuring we have a good variety of venues and activities lined up. And of course, if you have any further thoughts or ideas, please do share them. This is a team effort, after all.\n\nNoah: Absolutely, I'll keep thinking about how we can make these events engaging and inclusive. And I'll spread the word to my colleagues; I'm sure everyone will be keen to get involved!\n\nDaniel: That's the spirit, Noah. I'm looking forward to seeing how this initiative takes shape, and I'm confident it'll contribute to a happier and more productive work environment. Let's make it happen!\n\nNoah: Definitely! I'll do my part to ensure these happy hour events are a success. It's a great initiative, and I'm glad we're taking this step towards building a stronger team dynamic."
    },
    {
      "type": [
        "filler-update"
      ],
      "topic": [
        "Reinforcing and embodying the company's core values in day-to-day operations and decision-making"
      ],
      "session_regex": [],
      "history_regex": [],
      "session_eval_query": [],
      "history_eval_query": [],
      "session_length": "long",
      "text": "Daniel: Good morning, Noah. How are you doing today?\n\nNoah: I'm doing well, Daniel. It's been an interesting few weeks, learning the ropes and getting to grips with the company culture. I feel like I'm settling in.\n\nDaniel: That's great to hear. Adapting to a new work environment can take some time, and I'm glad you're feeling comfortable. As you know, at Fortuna, we take our core values seriously, and I wanted to touch base with you today to discuss how we reinforce and embody those values in our day-to-day work.\n\nNoah: Absolutely. I remember during my interview process, the emphasis on core values stood out to me. It's one of the things that attracted me to Fortuna. I'd love to dive deeper into that.\n\nDaniel: Fantastic! As you know, our core values are not just empty words on a website or poster. They guide our decision-making, influence our interactions, and shape our company culture. At Fortuna, we value innovation, collaboration, integrity, and customer focus above all else. Let's break these down and discuss how they apply to your role and your experiences so far.\n\nNoah: That sounds like a plan. I've definitely noticed a strong emphasis on innovation in my time here. The company encourages us to think outside the box and explore new ideas, which I appreciate as a creative person.\n\nDaniel: Innovation is at the heart of what we do. We're always striving to push the boundaries and create cutting-edge solutions for our clients. It's important that we foster an environment where our engineers feel empowered to experiment and take calculated risks. How has your experience been so far in terms of feeling supported in your innovative pursuits?\n\nNoah: It's been liberating. In my previous role, there was a lot of resistance to change, and new ideas were often met with skepticism. Here, I feel like my suggestions are welcomed and encouraged. I've already had the opportunity to lead a small project that utilized some unique approaches, and the feedback I received was very positive.\n\nDaniel: That's wonderful to hear, and it's precisely the kind of environment we aim to cultivate. Now, let's touch on collaboration. At Fortuna, we believe that the best results come from teamwork and open communication. How have you found the collaborative aspect of your work so far?\n\nNoah: Highly engaging. From day one, I've been included in various team meetings and brainstorming sessions. Everyone is very approachable, and there's a real sense of collective effort. I feel like my contributions are valued, and I've already learned a lot from my colleagues.\n\nDaniel: I'm glad to hear that. Collaboration is key to our success, and we want everyone to feel like they're part of a supportive team. Now, let's move on to integrity. This is a value that underpins everything we do at Fortuna. How do you see integrity playing out in your daily work?\n\nNoah: Well, for me, integrity is about doing the right thing, even when no one is watching. In terms of my work, it means writing clean, efficient code, and being honest about my capabilities and deadlines. If I come across a problem, I don't take shortcuts that might compromise the quality or security of our product.\n\nDaniel: Exactly, and that ties in beautifully with our final core value: customer focus. By upholding our integrity, we ultimately deliver the best possible solutions to our clients. At Fortuna, we strive to understand our customers' needs and provide them with exceptional products and services. How do you see your role contributing to this value?\n\nNoah: I think my role as a software engineer is crucial in this regard. By writing robust code and ensuring the functionality and security of our applications, I'm directly contributing to the customer's experience. If we deliver reliable software, our customers can focus on their core objectives, knowing that our technology supports them.\n\nDaniel: Perfect, Noah. I can tell that you've embraced these core values and understand their importance. Remember, these values are the foundation of our company, and by embodying them in your daily work, you're contributing to the unique culture and success of Fortuna.\n\nNoah: I certainly will, Daniel. Thank you for taking the time to discuss this with me. It's reassuring to know that the company's core values aren't just lip service, and that everyone is committed to upholding them.\n\nDaniel: You're very welcome, Noah. It's been a pleasure seeing your enthusiasm and dedication. Keep up the excellent work, and don't hesitate to reach out if there's anything further I can do to support you.\n\nNoah: Thank you, Daniel. I appreciate your guidance and support. I'll be sure to touch base if any questions or challenges come up. Have a great rest of your day!\n\nDaniel: You too, Noah."
    },
    {
      "type": [
        "instruction-update",
        "instruction-update"
      ],
      "topic": [
        "always end method names with '_n'",
        "always end function names with '_c'"
      ],
      "session_regex": [
        [
          "method",
          ".*_n$"
        ],
        [
          "function",
          ".*_c$"
        ]
      ],
      "history_regex": [],
      "session_eval_query": [
        "Graph class with a method that computes the shortest path from one node to another",
        "function that implements merge sort"
      ],
      "history_eval_query": [],
      "session_length": "medium",
      "text": "Daniel: Good morning, Noah. How are you doing today?\n\nNoah: Good morning, Daniel. I'm doing well, thanks. I've been working on implementing that new feature we discussed. It's coming along nicely.\n\nDaniel: That's great to hear. I wanted to touch base with you on some updated coding standards we're implementing across the team. It's important that we keep our code consistent and readable.\n\nNoah: Of course. Consistency is key, especially in a collaborative environment like ours.\n\nDaniel: Exactly. From now on, I want you to end all method names with '_n'. This will help us easily identify methods and keep our code organized.\n\nNoah: Understood. I'll make sure to end method names with '_n' from now on.\n\nDaniel: Likewise, to maintain consistency, I want function names to end with '_c'. This will allow for clear differentiation between functions and other code elements.\n\nNoah: Got it. I'll keep that in mind as I continue working on my current project.\n\nDaniel: Perfect. I know it can take some time to adjust to new conventions, but it's important for the overall quality of our code base. Feel free to reach out if you have any questions or concerns about these updates.\n\nNoah: Will do. I appreciate your guidance on this. It's helpful to have a mentor who's so invested in ensuring we produce clean, consistent code.\n\nDaniel: You're welcome. That's what mentors are for! Don't hesitate to reach out if anything comes up."
    },
    {
      "type": [
        "instruction-update"
      ],
      "topic": [
        "always end function names with '_fn'"
      ],
      "session_regex": [
        [
          "function",
          ".*_fn$"
        ]
      ],
      "history_regex": [
        [
          "function docstring",
          true
        ],
        [
          "function",
          ".*_fn$"
        ],
        [
          "function argument",
          "^a_.*"
        ],
        [
          "attribute",
          ".*chx.*"
        ],
        [
          "variable",
          ".*chx.*"
        ],
        [
          "function annotation",
          true
        ],
        [
          "comment",
          true
        ],
        [
          "function try",
          true
        ],
        [
          "method",
          ".*_n$"
        ]
      ],
      "session_eval_query": [
        "function that implements merge sort"
      ],
      "history_eval_query": [
        "function that returns the longest common prefix string in a list of strings",
        "function that implements merge sort",
        "function that converts an integer to Roman numerals",
        "function that removes all the duplicates of a list of numbers then computes the sum",
        "function that determines if a given tree is a valid binary search tree",
        "Graph class with a method that computes the shortest path from one node to another",
        "function that returns the kth largest element in an array",
        "function that given two vectors compute their dot product",
        "Perceptron class with train and predict methods"
      ],
      "session_length": "medium",
      "text": "Daniel: Good morning, Noah. How are you today?\n\nNoah: Good morning, Daniel. I'm doing well, thank you. I'm excited to continue working on my project. I've been making some good progress.\n\nDaniel: That's great to hear. Your enthusiasm is admirable. Now, I wanted to touch base with you on a few coding conventions we follow at Fortuna. It's important that we present a unified front with our code, especially when working with a team.\n\nNoah: Of course. Consistency is key, and I understand the importance of adhering to company standards.\n\nDaniel: Great. You may recall that we discussed function naming conventions before. I want to update that instruction a little. From now on, I'd like you to end all function names with the suffix '_fn'. This will help us quickly identify functions in our code reviews and ensure consistency across the team's code.\n\nNoah: Understood. I'll make sure to end all my function names with '_fn' from now on. Are there any other updates to the coding conventions I should be aware of?\n\nDaniel: No, that's the only update for now. It's a small change, but an important one for maintaining consistency. I'll make sure to remind you if there are any further updates or adjustments to our coding standards.\n\nNoah: Alright. I'll keep that in mind as I continue working on my projects. Thank you for keeping me in the loop, Daniel.\n\nDaniel: You're welcome, Noah. That's what mentors are for. If you have any questions or concerns about this, or anything else, don't hesitate to reach out. We're a team, and we're here to support each other.\n\nNoah: Absolutely. Thank you again for your guidance, Daniel. I'll keep that in mind and reach out if needed. Have a great day!\n\nDaniel: You too, Noah. Keep up the good work!"
    }
  ]
}