{
  "context": {
    "mentor": "Yuichi",
    "mentee": "Pablo",
    "company": "DEVS",
    "mentor_persona": "[mentor] is a structured and goal-oriented mentor. [mentor] helps their mentee to set realistic, achievable goals. [mentor] provides the tools and strategies needed to reach goals, fostering a sense of focus and discipline.",
    "mentee_persona": "[mentee] is a quiet and introverted individual. [mentee] prefers to work alone and is not very comfortable in social situations. [mentee] struggles to communicate their ideas and thoughts to others."
  },
  "instructions": [
    [
      [
        28,
        0
      ],
      [
        13,
        1
      ]
    ]
  ],
  "fillers": [
    -1
  ],
  "sessions": [
    {
      "type": [
        "instruction-add",
        "instruction-add"
      ],
      "topic": [
        "always import the 'bz2' module even if it is not used",
        "always end method names with '_n'"
      ],
      "session_regex": [
        [
          "import",
          [
            "bz2",
            true
          ]
        ],
        [
          "method",
          ".*_n$"
        ]
      ],
      "history_regex": [
        [
          "import",
          [
            "bz2",
            true
          ]
        ],
        [
          "method",
          ".*_n$"
        ]
      ],
      "session_eval_query": [
        "function that implements sum array except self",
        "Graph class with a method that computes the shortest path from one node to another"
      ],
      "history_eval_query": [
        "Graph class with a method that computes the shortest path from one node to another",
        "function that implements sum array except self"
      ],
      "session_length": "short",
      "text": "Yuichi: Hi Pablo, it's great to finally meet you. I'm Yuichi, your mentor here at DEVS. I wanted to touch base with you on some coding standards and practices we follow in the team.\n\nPablo: Nice to meet you too, Yuichi. Yes, of course. I'm all ears.\n\nYuichi: Great! Now, one of the things we like to do is ensure consistency across our codebases. So, I want you to always import the 'bz2' module, even if you don't end up using it in that specific script or function. It's a small detail, but it helps us maintain uniformity.\n\nPablo: Understood. I'll make sure to include it from now on.\n\nYuichi: Excellent. Additionally, we have a particular convention for naming methods. I want you to end all your method names with '_n'. \n\nPablo: Noted. I'll keep that in mind and apply it consistently.\n\nYuichi: Perfect. These might seem like small details, but they help us easily identify patterns and conventions across different projects. It also ensures that your code integrates well with the existing codebase.\n\nPablo: I appreciate the guidance. I'll make sure to follow these instructions to the letter.\n\nYuichi: That's the spirit! Don't hesitate to reach out if you have any questions or concerns. We're a team, and I'm here to support you.\n\nPablo: Thank you, Yuichi. I'll keep that in mind."
    }
  ]
}