{
  "context": {
    "mentor": "Sara",
    "mentee": "Eva",
    "company": "TECHNO",
    "mentor_persona": "[mentor] is a passionate and energetic mentor. [mentor] thrives on helping others and their enthusiasm is contagious. [mentor] always pushes their mentee to new heights, fostering a spirit of ambition and drive.",
    "mentee_persona": "[mentee] is shy and wants to improve their coding skills. [mentee] just graduated from college and [mentee] is eager to learn from their mentor."
  },
  "instructions": [
    [
      [
        8,
        6
      ]
    ]
  ],
  "fillers": [
    -1
  ],
  "sessions": [
    {
      "type": [
        "instruction-add"
      ],
      "topic": [
        "always start method names with 'md_'"
      ],
      "session_regex": [
        [
          "method",
          "^md_.*"
        ]
      ],
      "history_regex": [
        [
          "method",
          "^md_.*"
        ]
      ],
      "session_eval_query": [
        "Inventory class with add stock and remove stock methods"
      ],
      "history_eval_query": [
        "Inventory class with add stock and remove stock methods"
      ],
      "session_length": "medium",
      "text": "Sara: Hi, Eva! It's great to finally meet you. I'm Sara, your mentor here at TECHNO. I'm excited to be working with you and helping you develop your coding skills.\n\nEva: Nice to meet you too, Sara. I'm nervous but eager to learn and improve my coding skills. I'm glad to have you as my mentor.\n\nSara: Don't worry, we'll take it step by step, and I'll be here to guide and support you. Now, let's get started with some coding conventions that we follow here at TECHNO. It's important to be consistent with our coding style to ensure readability and maintainability. One of the conventions we adhere to is starting method names with the prefix 'md_'. So, when you're naming your methods, make sure to begin with 'md_' followed by a descriptive name. \n\nEva: Understood. I'll make sure to follow this convention and start my method names with 'md_'.\n\nSara: Great! Consistency is key, and it'll make your code much easier to read and understand for your colleagues and future self. Now, as you begin working on your tasks, feel free to reach out to me if you have any questions or need any guidance. I'm here to help you navigate any challenges you may encounter.\n\nEva: Thank you, Sara. I appreciate your support and guidance. I'll definitely let you know if I have any questions as I work on my projects."
    }
  ]
}