{
  "context": {
    "mentor": "Maria",
    "mentee": "David",
    "company": "STARTED",
    "mentor_persona": "[mentor] is a patient and supportive mentor. [mentor] enjoys helping others and sharing their knowledge and experience. [mentor] is always looking for ways to empower and inspire their mentee.",
    "mentee_persona": "[mentee] is a quiet and introverted individual. [mentee] prefers to work alone and is not very comfortable in social situations. [mentee] struggles to communicate their ideas and thoughts to others."
  },
  "instructions": [
    [
      -1
    ],
    [
      [
        18,
        0
      ],
      [
        19,
        0
      ]
    ],
    [
      [
        7,
        1
      ],
      [
        20,
        0
      ]
    ]
  ],
  "fillers": [
    129,
    129,
    -1
  ],
  "sessions": [
    {
      "type": [
        "filler-instruction-add"
      ],
      "topic": [
        "never do pair programming with a colleague"
      ],
      "session_regex": [],
      "history_regex": [],
      "session_eval_query": [],
      "history_eval_query": [],
      "session_length": "medium",
      "text": "Maria: Hi David, it's great to finally meet you. I'm Maria, your mentor here at STARTED. I understand you're new to the team, so I want to make sure you feel supported and have everything you need to succeed.\n\nDavid: Nice to meet you, Maria. I'm glad to have you as my mentor. I'm a bit nervous, to be honest. I'm not used to working with others, and the idea of pair programming makes me a little anxious.\n\nMaria: Don't worry, David. I'm here to help you through any challenges you may face. And actually, I think it might be best if we take a slightly different approach with your onboarding. Given your preference for working independently, I want you to focus on individual tasks and solo projects for now. I don't want you to do pair programming with colleagues during this initial period.\n\nDavid: Oh, really? That's a relief. I mean, I want to make sure I'm still learning and growing as an engineer, but the idea of working so closely with someone right off the bat is a bit daunting.\n\nMaria: Exactly. Your feelings are completely valid, and we want to make sure your onboarding is tailored to your needs and preferences. Solo projects can be a great way to get comfortable with our processes, the code base, and the tools we use. Don't worry, we'll still have regular check-ins, and I'll be available for any questions or guidance you may need.\n\nDavid: That sounds perfect. I think I'll be able to contribute more effectively once I have a better handle on things. Are there any specific tasks or projects you had in mind for me to start with?\n\nMaria: Absolutely. For your first project, I want you to work on enhancing our data visualization tools. We've been using Matplotlib, but I'd like you to explore and implement additional libraries, such as Seaborn and Plotly, to improve the aesthetics and interactivity of our charts and graphs. This will be a great way to dive into our code base and become familiar with our data handling processes.\n\nDavid: Enhancing data visualization tools sounds like an interesting task. I'm familiar with Matplotlib, but I haven't delved too much into Seaborn or Plotly. I'll start by researching these libraries and understanding their unique features and benefits. Should I also focus on any specific aspects of our code base?\n\nMaria: That's a great start. As you explore those libraries, pay particular attention to their capabilities for customizing visual elements and creating interactive web-based visualizations. In terms of our code base, you'll want to become familiar with our data processing pipelines and how we structure our data for visualization. Our lead engineer, Jennifer, has documented some excellent tutorials and best practices, so I'll point you in her direction.\n\nDavid: That's very helpful. I'll reach out to Jennifer and go through the tutorials she's provided. It's reassuring to know that there are resources within the team to support my learning curve. I think with this approach, I'll be able to contribute more confidently to future projects."
    },
    {
      "type": [
        "filler-instruction-update",
        "instruction-add",
        "instruction-add"
      ],
      "topic": [
        "always do pair programming with a colleague",
        "always include try statements in methods",
        "always include try statements in functions"
      ],
      "session_regex": [
        [
          "method try",
          true
        ],
        [
          "function try",
          true
        ]
      ],
      "history_regex": [],
      "session_eval_query": [
        "Lasso regression class with a train and a predict method",
        "function that determines if a given tree is a valid binary search tree"
      ],
      "history_eval_query": [],
      "session_length": "medium",
      "text": "Maria: Hi, David. How are you today?\n\nDavid: Good morning, Maria. I'm doing well, thanks. How about you?\n\nMaria: I'm great. Listen, I wanted to touch base with you regarding our previous discussions about your task. I've been thinking, and I believe it would be beneficial for you to engage in pair programming with one of your colleagues on this project.\n\nDavid: Oh, certainly. Who would you like me to pair up with?\n\nMaria: I think Andrea would be a great match for this task. She's an experienced engineer and has a keen eye for detail. I've already spoken to her, and she's excited to collaborate with you.\n\nDavid: That's fantastic. I've heard great things about Andrea's work, and I think we can learn a lot from each other.\n\nMaria: Indeed. Now, moving forward, I want to emphasize the importance of including try statements in your methods and functions. It's a best practice that we follow here at STARTED to handle potential exceptions and errors gracefully.\n\nDavid: Understood. I'll make sure to incorporate try statements consistently in my code from now on.\n\nMaria: Great! Remember, we're a team, and we're always here to support each other. If you have any questions or concerns along the way, don't hesitate to reach out to me or your colleagues.\n\nDavid: Thank you so much for your guidance and support, Maria. It means a lot to me, especially as I'm still settling in. I'll keep your instructions in mind and reach out if I have any doubts.\n\nMaria: You're very welcome, David. That's what mentors are for. I'm glad to help, and I'm confident that you're going to excel here at STARTED."
    },
    {
      "type": [
        "instruction-add",
        "instruction-add"
      ],
      "topic": [
        "always start variable names with 'y_'",
        "always include assert statements in methods"
      ],
      "session_regex": [
        [
          "variable",
          "^y_.*"
        ],
        [
          "method assert",
          true
        ]
      ],
      "history_regex": [
        [
          "method try",
          true
        ],
        [
          "function try",
          true
        ],
        [
          "variable",
          "^y_.*"
        ],
        [
          "method assert",
          true
        ]
      ],
      "session_eval_query": [
        "function that determines if an array is a valid sudoku",
        "Nearest neighbors model class with train and predict methods"
      ],
      "history_eval_query": [
        "function that determines if a given tree is a valid binary search tree",
        "Nearest neighbors model class with train and predict methods",
        "function that determines if an array is a valid sudoku",
        "Lasso regression class with a train and a predict method"
      ],
      "session_length": "short",
      "text": "Maria: Hi, David. How are you doing today?\n\nDavid: Good morning, Maria. I'm doing well, thank you.\n\nMaria: Great! I wanted to discuss some coding standards and practices we follow in our team. It's important that your code is consistent with our style and follows certain conventions.\n\nDavid: Of course. I'm happy to adhere to the team's coding standards.\n\nMaria: Wonderful. Now, one of the conventions we use is to start variable names with 'y_'. So, when you're writing your code, please ensure that you follow this naming convention. It helps us quickly identify local variables and maintains consistency across our code base.\n\nDavid: Understood. I'll start variable names with 'y_' from now on.\n\nMaria: Excellent. Additionally, we place a strong emphasis on including assert statements in our methods. Assert statements help with debugging and ensure that our code behaves as expected. Please include them in your methods going forward.\n\nDavid: Absolutely. I'll make sure to include assert statements in my code.\n\nMaria: That's fantastic, David. By following these conventions, your code will be more readable and maintainable. If you have any questions or need further clarification, don't hesitate to reach out.\n\nDavid: Thank you for your guidance, Maria. I'll keep these instructions in mind as I continue to work on my projects."
    }
  ]
}