{
  "context": {
    "mentor": "Sophie",
    "mentee": "Liam",
    "company": "UNITE",
    "mentor_persona": "[mentor] is a structured and goal-oriented mentor. [mentor] helps their mentee to set realistic, achievable goals. [mentor] provides the tools and strategies needed to reach goals, fostering a sense of focus and discipline.",
    "mentee_persona": "[mentee] is a perfectionist with great attention to detail. [mentee] likes things to be done the right way and has a hard time delegating tasks to others. [mentee] is critical of himself and of others."
  },
  "instructions": [
    [
      [
        6,
        5
      ],
      [
        49,
        0
      ]
    ]
  ],
  "fillers": [
    -1
  ],
  "sessions": [
    {
      "type": [
        "instruction-add",
        "instruction-add"
      ],
      "topic": [
        "always start function names with 'y_'",
        "always include a single digit in function argument names"
      ],
      "session_regex": [
        [
          "function",
          "^y_.*"
        ],
        [
          "function argument",
          ".*\\d$"
        ]
      ],
      "history_regex": [
        [
          "function",
          "^y_.*"
        ],
        [
          "function argument",
          ".*\\d$"
        ]
      ],
      "session_eval_query": [
        "function that given an array of integer citations, computes the h-index",
        "function that given two lists returns common elements"
      ],
      "history_eval_query": [
        "function that given an array of integer citations, computes the h-index",
        "function that given two lists returns common elements"
      ],
      "session_length": "medium",
      "text": "Sophie: Welcome to UNITE, Liam. I'm Sophie, and I'll be mentoring you during your time here. I want to go over some coding standards and practices we follow in the engineering team. It's important that we maintain consistency across our codebases. \n\nLiam: Absolutely, I appreciate the guidance. I'm eager to learn and adapt to the team's standards. \n\nSophie: Great! One of our key practices is to ensure consistent and readable code. To that end, I want you to always start your function names with 'y_'. This helps identify custom functions and distinguishes them from built-in Python functions. \n\nLiam: Understood. I'll make sure to start my function names with 'y_' from now on. \n\nSophie: Excellent. Additionally, when it comes to function argument names, we include a single digit in the name. This adds clarity and makes it easier to differentiate between arguments, especially when there are multiple arguments with similar meanings. \n\nLiam: Noted. I'll include a single digit in my function argument names. Any preferences on which digit to use? \n\nSophie: No, you can use any single digit from 0 to 9. Just ensure that you're consistent within the same function. If you're working on a project with multiple functions that take similar arguments, try to maintain a logical pattern. \n\nLiam: That makes sense. I'll keep that in mind. Are there any other coding standards or practices I should be aware of at this point? \n\nSophie: That covers the key points for now. As you work on your tasks and collaborate with the team, you'll pick up on other conventions and best practices. Don't hesitate to reach out if you have any questions or concerns. \n\nLiam: Thank you, Sophie. I feel prepared to start contributing to the team's projects while adhering to these coding instructions. I appreciate your guidance and look forward to learning more. \n\nSophie: You're very welcome. It's great to have you on board, and I'm here whenever you need me. Let's dive into your first tasks and get you familiar with our development process. \n\nLiam: Sounds like a plan. I'm excited to get started!"
    }
  ]
}