{
  "context": {
    "mentor": "Pedro",
    "mentee": "Marta",
    "company": "CODEM",
    "mentor_persona": "[mentor] is a strict and demanding mentor. [mentor] has high expectations for their mentee. [mentor] goes straight to the point and is very clear.",
    "mentee_persona": "[mentee] is a quiet and introverted individual. [mentee] prefers to work alone and is not very comfortable in social situations. [mentee] struggles to communicate their ideas and thoughts to others."
  },
  "instructions": [
    [
      [
        11,
        3
      ]
    ]
  ],
  "fillers": [
    27
  ],
  "sessions": [
    {
      "type": [
        "filler-add",
        "instruction-add"
      ],
      "topic": [
        "Celebrating employee birthdays, work anniversaries, and achievements with recognition and rewards",
        "always end function names with '_d'"
      ],
      "session_regex": [
        [
          "function",
          ".*_d$"
        ]
      ],
      "history_regex": [
        [
          "function",
          ".*_d$"
        ]
      ],
      "session_eval_query": [
        "function that implements merge sort"
      ],
      "history_eval_query": [
        "function that implements merge sort"
      ],
      "session_length": "long",
      "text": "Pedro: Hi, you must be Marta. I'm Pedro, your mentor here at CODEM. It's great to finally meet you. I want to ensure you get the support and guidance you need as you settle into your new role.\n\nMarta: Nice to meet you, Pedro. I appreciate your help. I'm excited but also a bit nervous about starting here.\n\nPedro: That's completely understandable. Starting a new job can be daunting, but we'll take it step by step. I want to discuss some of our company traditions and policies first. We value our employees and like to celebrate their birthdays, work anniversaries, and special achievements. It's a way to foster a sense of community and recognize the hard work of our team members.\n\nMarta: That sounds wonderful. It's nice to know that the company values and appreciates its employees.\n\nPedro: Absolutely. We usually organize small celebrations during lunch breaks or after work hours, depending on everyone's preferences. It's a good opportunity to get to know your colleagues better and feel part of the CODEM family. Now, regarding your role as a software engineer, I want to go over some coding standards and practices we follow here. Consistency is important to us, and I'd like you to follow a specific naming convention for your function names. End all your function names with '_d'. This helps us maintain a clear distinction and easily identify your functions.\n\nMarta: Understood. I'll make sure to follow that convention from now on.\n\nPedro: Great. Consistency is key, especially when working with a large code base and multiple team members. Now, as you get started, I want you to familiarize yourself with our version control system. Make sure you understand the process of checking out code, making changes, and committing those changes back to the repository. I'll send you some resources and documentation on this later today.\n\nMarta: That would be helpful. I prefer to have a clear understanding of the processes before I begin, so I'm looking forward to going through those resources.\n\nPedro: Excellent. Don't hesitate to reach out if you have any questions or concerns along the way. My role as your mentor is to provide guidance and support as you navigate your new role. Feel free to schedule a meeting with me anytime, and we can discuss any challenges or topics that come up.\n\nMarta: Thank you, Pedro. I feel more at ease knowing I have your support. I'll definitely take you up on that offer if I encounter any hurdles.\n\nPedro: That's what I'm here for. Well, I think we've covered quite a bit for your first day. Take your time to process everything, and don't hesitate to reach out. Enjoy the rest of your day, and I'll see you tomorrow.\n\nMarta: Thank you, Pedro. It was great meeting you, and I look forward to working with you."
    }
  ]
}