{
  "context": {
    "mentor": "Sara",
    "mentee": "Eva",
    "company": "TECHNO",
    "mentor_persona": "[mentor] is a passionate and energetic mentor. [mentor] thrives on helping others and their enthusiasm is contagious. [mentor] always pushes their mentee to new heights, fostering a spirit of ambition and drive.",
    "mentee_persona": "[mentee] is shy and wants to improve their coding skills. [mentee] just graduated from college and [mentee] is eager to learn from their mentor."
  },
  "instructions": [
    [
      [
        13,
        5
      ]
    ]
  ],
  "fillers": [
    -1
  ],
  "sessions": [
    {
      "type": [
        "instruction-add"
      ],
      "topic": [
        "always end method names with '_b'"
      ],
      "session_regex": [
        [
          "method",
          ".*_b$"
        ]
      ],
      "history_regex": [
        [
          "method",
          ".*_b$"
        ]
      ],
      "session_eval_query": [
        "Graph class with a method that computes the shortest path from one node to another"
      ],
      "history_eval_query": [
        "Graph class with a method that computes the shortest path from one node to another"
      ],
      "session_length": "long",
      "text": "Sara: Hi, Eva! It's great to finally meet you. I'm Sara, your mentor here at TECHNO. I'm excited to be working with you and helping you settle into your new role.\n\nEva: Nice to meet you, Sara. I'm nervous but eager to learn and contribute to the team.\n\nSara: Don't worry, that's completely normal. We all started from somewhere, and I'm here to support you every step of the way. Now, let's get down to business. At TECHNO, we take our coding standards and practices seriously. It's important for us to maintain consistency and readability in our codebases.\n\nEva: Absolutely. I want to make sure I follow the best practices and fit in with the team's coding style.\n\nSara: Great attitude. Now, one of the conventions we follow here is to end all method names with '_b'. I want you to keep that in mind as you start writing code. Be consistent with this naming convention, and your code will align with ours.\n\nEva: Understood. I'll make sure to end all my method names with '_b'.\n\nSara: Perfect. This might seem like a small detail, but it's an important one for us. It helps us quickly identify methods and promotes uniformity in our code. Now, I'll be providing you with some initial tasks to get you familiar with our systems and processes. Don't hesitate to reach out if you have any questions or concerns along the way.\n\nEva: Thank you, Sara. I appreciate your guidance and support. I'll do my best to learn the ropes quickly and adapt to the team's coding standards.\n\nSara: That's the spirit! Remember, we're all here to help each other grow. I'm confident that with your dedication and our mentorship program, you'll become a valuable asset to the team. Now, let's dive into your onboarding and get you set up with the tools and knowledge you need to succeed.\n\nEva: Sounds great! I'm excited to get started and contribute my skills to the team.\n\nSara: Fantastic! We have an exciting journey ahead of us. Now, let's begin with an overview of our development environment and the tools we use daily...\n\n[The conversation continues with Sara providing Eva with an introduction to the company's development processes and tools, setting the stage for future discussions and mentorship sessions.]"
    }
  ]
}