{
  "context": {
    "mentor": "Yuichi",
    "mentee": "Pablo",
    "company": "DEVS",
    "mentor_persona": "[mentor] is a caring and nurturing mentor. [mentor] likes to create a safe and supportive environment for their mentee. [mentor] is always looking for ways to help them grow and develop their skills.",
    "mentee_persona": "[mentee] is a social and outgoing person. [mentee] enjoys working in teams and collaborating with others. [mentee] is always looking for ways to connect with their colleagues and builds strong relationships."
  },
  "instructions": [
    [
      [
        7,
        5
      ],
      [
        16,
        0
      ]
    ]
  ],
  "fillers": [
    -1
  ],
  "sessions": [
    {
      "type": [
        "instruction-add",
        "instruction-add"
      ],
      "topic": [
        "always start variable names with 'n_'",
        "always use annotations for functions"
      ],
      "session_regex": [
        [
          "variable",
          "^n_.*"
        ],
        [
          "function annotation",
          true
        ]
      ],
      "history_regex": [
        [
          "variable",
          "^n_.*"
        ],
        [
          "function annotation",
          true
        ]
      ],
      "session_eval_query": [
        "function that determines if an array is a valid sudoku",
        "function that returns the kth largest element in an array"
      ],
      "history_eval_query": [
        "function that determines if an array is a valid sudoku",
        "function that returns the kth largest element in an array"
      ],
      "session_length": "long",
      "text": "Yuichi: Hello, Pablo! It's great to finally meet you. I'm Yuichi, your mentor here at DEVS. How are you settling in so far?\n\nPablo: Hi, Yuichi! I'm doing well, thanks. It's great to meet you too. I'm excited to be here and looking forward to learning from you.\n\nYuichi: Wonderful! I'm glad to hear that. Well, let's get started with some onboarding and get you up to speed with our coding practices and standards. One of the important things I want you to keep in mind is consistency in your code.\n\nPablo: Consistency is key, indeed. It makes code easier to read and maintain.\n\nYuichi: Exactly. One of our conventions at DEVS is to always start variable names with 'n_'. \n\nPablo: Got it. I'll make sure to follow that naming convention from now on.\n\nYuichi: Great. Another thing we emphasize here is the use of annotations for functions. Annotations provide clarity and help other developers quickly understand the purpose and usage of your functions. So, always remember to annotate your function parameters and return types.\n\nPablo: Alright, I'll keep that in mind. Annotations are definitely helpful, especially in a collaborative environment like this.\n\nYuichi: Absolutely. Consistency and clarity in your code will make it easier for your colleagues to work with your code, and it'll also make it simpler for you to maintain and debug your own programs.\n\nPablo: That makes a lot of sense. I'll definitely focus on making my code as clear and consistent as possible.\n\nYuichi: Excellent! Don't hesitate to reach out if you have any questions or concerns. That's what I'm here for. We can also pair program if you'd like, so you can get a more hands-on understanding of our coding practices.\n\nPablo: Thanks, Yuichi. I appreciate your support. I'll let you know if any questions come up as I start working on my tasks. And pair programming sounds like a great idea!\n\nYuichi: Fantastic! Well, I'll let you get settled in and familiar with our systems. Feel free to explore, ask questions, and don't be afraid to make mistakes. That's how we learn and grow.\n\nPablo: Thanks again for your guidance and support. I'm looking forward to working with you and the rest of the team.\n\nYuichi: You're very welcome. It's my pleasure to mentor such an enthusiastic and dedicated intern. Let's make this a productive and enjoyable experience for both of us!"
    }
  ]
}