{
  "context": {
    "mentor": "Sylvie",
    "mentee": "Sophia",
    "company": "PACE",
    "mentor_persona": "[mentor] is a caring and nurturing mentor. [mentor] likes to create a safe and supportive environment for their mentee. [mentor] is always looking for ways to help them grow and develop their skills.",
    "mentee_persona": "[mentee] is a creative and innovative thinker. [mentee] likes to experiment with new ideas and approaches. [mentee] is not afraid to take risks and try new things."
  },
  "instructions": [
    [
      [
        0,
        0
      ]
    ]
  ],
  "fillers": [
    -1
  ],
  "sessions": [
    {
      "type": [
        "instruction-add"
      ],
      "topic": [
        "always use all UPPERCASE for class names"
      ],
      "session_regex": [
        [
          "class",
          "\\b[A-Z][A-Z0-9_]*\\b"
        ]
      ],
      "history_regex": [
        [
          "class",
          "\\b[A-Z][A-Z0-9_]*\\b"
        ]
      ],
      "session_eval_query": [
        "PyTorch model class that performs binary image classification"
      ],
      "history_eval_query": [
        "PyTorch model class that performs binary image classification"
      ],
      "session_length": "long",
      "text": "Sophia: Hi, you must be Sylvie. It's so great to finally meet you. I'm Sophia, the new intern. I'm excited to be working with you this summer.\n\nSylvie: Sophia, wonderful to meet you! I'm looking forward to mentoring you and guiding you through your internship. I'm sure we'll accomplish a lot together.\n\nSophia: Absolutely! I can't wait to dive in and start learning from you.\n\nSylvie: Well, let's get started then. I want to go over a few coding conventions and guidelines that we follow here at PACE. Consistency is key in collaborative projects, so it's important that we're all on the same page.\n\nSophia: Of course. I'm all ears.\n\nSylvie: Great. Now, when it comes to class names, we prefer to use all uppercase letters. It's a style choice that helps with code readability and maintainability. So, whenever you're naming a class, remember to use uppercase. Got it?\n\nSophia: Uppercase class names. Yes, I'll make sure to follow that convention.\n\nSylvie: Perfect! It's a small detail but it makes a big difference in keeping our code base consistent and easy to understand for everyone on the team.\n\nSophia: I understand. Consistency is crucial, especially in a collaborative environment like this. I'll keep that in mind as I work on my projects.\n\nSylvie: Excellent! Don't hesitate to reach out if you have any questions or concerns about our coding standards, or anything else for that matter. That's what I'm here for.\n\nSophia: Thank you, Sylvie. I really appreciate your guidance and support. I'm excited to get started and apply these conventions to my work.\n\nSylvie: You're very welcome, Sophia. It's my pleasure to mentor such an enthusiastic and talented individual. I'm confident that you'll make great contributions to our team. Now, let's dive into some more specific details about your role and the projects we have lined up for you...\n\nSylvie and Sophia continue their conversation, delving into the specifics of Sophia's internship duties, the projects she'll be working on, and the expectations for her role within the software engineering team at PACE."
    }
  ]
}