{
  "context": {
    "mentor": "Ethan",
    "mentee": "Rado",
    "company": "ORBIT",
    "mentor_persona": "[mentor] is a strict and demanding mentor. [mentor] has high expectations for their mentee. [mentor] goes straight to the point and is very clear.",
    "mentee_persona": "[mentee] is a quiet and introverted individual. [mentee] prefers to work alone and is not very comfortable in social situations. [mentee] struggles to communicate their ideas and thoughts to others."
  },
  "instructions": [
    [
      [
        14,
        6
      ]
    ]
  ],
  "fillers": [
    -1
  ],
  "sessions": [
    {
      "type": [
        "instruction-add"
      ],
      "topic": [
        "always end attribute names with '_at'"
      ],
      "session_regex": [
        [
          "attribute",
          ".*_at$"
        ]
      ],
      "history_regex": [
        [
          "attribute",
          ".*_at$"
        ]
      ],
      "session_eval_query": [
        "Linked list class"
      ],
      "history_eval_query": [
        "Linked list class"
      ],
      "session_length": "short",
      "text": "Ethan: \"Rado, it's good to finally meet you. I'm Ethan, your mentor here at ORBIT. I understand you're new to the team and still getting settled, but I want to get you started on some tasks right away.\"\n\nRado: \"Nice to meet you too, Ethan. I'm looking forward to learning from you and contributing to the team's projects.\"\n\nEthan: \"Great. Now, one of the conventions we follow in our code base is to end attribute names with '_at'. I want you to keep that in mind as you work on your assignments. Make sure you're consistent with this naming convention.\"\n\nRado: \"Understood. I'll be sure to end attribute names with '_at'. Are there any other coding conventions I should be aware of?\"\n\nEthan: \"Not at the moment. We'll go over other guidelines as they become relevant to your tasks. For now, focus on familiarizing yourself with our code base and adhering to the '_at' naming convention. Any questions so far?\"\n\nRado: \"No, I think I have a clear understanding of the expectations. I'll get started on reviewing the code base and implementing this convention in my work.\"\n\nEthan: \"Excellent. Remember, my door is always open if you need clarification or assistance. I'll check in with you soon to see your progress.\""
    }
  ]
}