{
  "context": {
    "mentor": "Daniel",
    "mentee": "Noah",
    "company": "FORTUNA",
    "mentor_persona": "[mentor] is a strict and demanding mentor. [mentor] has high expectations for their mentee. [mentor] goes straight to the point and is very clear.",
    "mentee_persona": "[mentee] is a creative and innovative thinker. [mentee] likes to experiment with new ideas and approaches. [mentee] is not afraid to take risks and try new things."
  },
  "instructions": [
    [
      -1
    ],
    [
      [
        11,
        2
      ]
    ]
  ],
  "fillers": [
    118,
    -1
  ],
  "sessions": [
    {
      "type": [
        "filler-instruction-add"
      ],
      "topic": [
        "never use a VPN when working remotely"
      ],
      "session_regex": [],
      "history_regex": [],
      "session_eval_query": [],
      "history_eval_query": [],
      "session_length": "short",
      "text": "Daniel: Noah, it's good to finally put a face to the name. I'm Daniel, your mentor here at Fortuna. I understand you're new to the remote work policy, so I want to go over some expectations and guidelines.\n\nNoah: Nice to meet you, Daniel. I'm excited to be joining the team and working remotely. I've heard a lot about the company's culture and policies.\n\nDaniel: Great. Now, one of the key things we emphasize is a secure and transparent remote work environment. We do not tolerate the use of VPNs under any circumstances. It is imperative that you never use a VPN when working remotely. Can I trust that you will follow this rule?\n\nNoah: Absolutely. I understand the security concerns and the need for transparency. I won't use a VPN. Are there any other security measures or company policies I should be aware of?\n\nDaniel: That's good to hear. We also have strict guidelines regarding confidentiality and data protection. You'll be handling sensitive company information, so it's crucial that you adhere to our security protocols at all times. Always use secure connections, encrypt sensitive data, and report any suspicious activity immediately.\n\nNoah: Understood. I'll make sure to familiarize myself with the security protocols and company policies. I take these matters seriously and will ensure that I follow the guidelines."
    },
    {
      "type": [
        "instruction-add"
      ],
      "topic": [
        "always end function names with '_c'"
      ],
      "session_regex": [
        [
          "function",
          ".*_c$"
        ]
      ],
      "history_regex": [
        [
          "function",
          ".*_c$"
        ]
      ],
      "session_eval_query": [
        "function that implements merge sort"
      ],
      "history_eval_query": [
        "function that implements merge sort"
      ],
      "session_length": "medium",
      "text": "Daniel: Noah, I want to make sure we're on the same page with our coding standards. It's important for consistency and readability.\n\nNoah: Absolutely, Daniel. I'm all for adhering to a uniform style. It makes collaboration much easier.\n\nDaniel: Good. From now on, I need you to end all your function names with '_c'. Understood?\n\nNoah: Understood. I'll make sure to follow that convention from now on.\n\nDaniel: Excellent. This will help us identify functions quickly, especially when we're dealing with a large codebase.\n\nNoah: Definitely. It adds a bit of visual differentiation. I'll keep that in mind as I work on my current tasks.\n\nDaniel: Good. Also, remember to keep your function names descriptive and meaningful. Concise, yet informative. That way, your code will be more self-documenting.\n\nNoah: Absolutely. I aim to make my code as readable as possible. Clear function names are a big part of that.\n\nDaniel: That's right. Now, moving forward, I'd like you to start thinking about modularizing your code. We'll discuss that in more detail soon, but for now, focus on creating functions that are reusable and have a single responsibility.\n\nNoah: That makes sense. I'll keep my functions focused and avoid cramming multiple tasks into one.\n\nDaniel: Exactly. And if you have any questions or need clarification on anything, don't hesitate to reach out. That's what I'm here for.\n\nNoah: I will, Daniel. Thanks for the guidance. I'll make sure my code reflects these standards.\n\nDaniel: You're welcome. That's what mentorship is all about. Now, let's get back to work and tackle those tasks!"
    }
  ]
}