{
  "context": {
    "mentor": "Alice",
    "mentee": "Bob",
    "company": "NEXT",
    "mentor_persona": "[mentor] is a caring and nurturing mentor. [mentor] likes to create a safe and supportive environment for their mentee. [mentor] is always looking for ways to help them grow and develop their skills.",
    "mentee_persona": "[mentee] is a confident and ambitious software engineer. [mentee] is always looking for new challenges and opportunities to grow. [mentee] has been working in the industry for a few years now."
  },
  "instructions": [
    [
      [
        7,
        6
      ]
    ]
  ],
  "fillers": [
    48
  ],
  "sessions": [
    {
      "type": [
        "filler-add",
        "instruction-add"
      ],
      "topic": [
        "Building a culture of adaptability and resilience to navigate change and uncertainty",
        "always start variable names with 'vr_'"
      ],
      "session_regex": [
        [
          "variable",
          "^vr_.*"
        ]
      ],
      "history_regex": [
        [
          "variable",
          "^vr_.*"
        ]
      ],
      "session_eval_query": [
        "function that determines if an array is a valid sudoku"
      ],
      "history_eval_query": [
        "function that determines if an array is a valid sudoku"
      ],
      "session_length": "short",
      "text": "Alice: Hi Bob! It's great to finally meet you. I'm Alice, your mentor here at NEXT. I wanted to touch base with you on your first day and talk about navigating your new role. \n\nBob: Hi Alice! It's nice to meet you too. I'm excited to be joining the team and I'm looking forward to learning from your mentorship. \n\nAlice: Wonderful! I believe that building a culture of adaptability and resilience is key to our success as software engineers. The industry is ever-evolving, and we must be prepared to navigate change and uncertainty. \n\nBob: I couldn't agree more. Adaptability is crucial in our field. I'm eager to dive into new projects and challenges, and I'm committed to developing the skills I need to thrive in this environment. \n\nAlice: That's fantastic to hear, Bob. Remember, it's okay to embrace uncertainty. It's all about learning and growing together. Now, regarding your coding practices, there are a few conventions I'd like you to follow. \n\nBob: Of course. I'm all ears. \n\nAlice: Always start your variable names with 'vr_'. This is a convention we use here at NEXT to promote code readability and consistency. It's important to adhere to these standards to ensure seamless collaboration with your teammates. \n\nBob: Understood. I'll make sure to start all my variable names with 'vr_'. \n\nAlice: Great! I'm excited to see your contributions, Bob. Don't hesitate to reach out if you have any questions or concerns. That's what I'm here for. \n\nBob: Thanks, Alice. I appreciate your support and guidance. I'm looking forward to getting started and learning the ropes. \n\nAlice: You're very welcome. Enjoy the rest of your day and I'll see you soon! \n\nBob: You too, Alice!"
    }
  ]
}