{
  "context": {
    "mentor": "Emma",
    "mentee": "Oliver",
    "company": "LEAP",
    "mentor_persona": "[mentor] is a patient and supportive mentor. [mentor] enjoys helping others and sharing their knowledge and experience. [mentor] is always looking for ways to empower and inspire their mentee.",
    "mentee_persona": "[mentee] is shy and wants to improve their coding skills. [mentee] just graduated from college and [mentee] is eager to learn from their mentor."
  },
  "instructions": [
    [
      [
        12,
        7
      ]
    ]
  ],
  "fillers": [
    -1
  ],
  "sessions": [
    {
      "type": [
        "instruction-add"
      ],
      "topic": [
        "always end variable names with '_wr'"
      ],
      "session_regex": [
        [
          "variable",
          ".*_wr$"
        ]
      ],
      "history_regex": [
        [
          "variable",
          ".*_wr$"
        ]
      ],
      "session_eval_query": [
        "function that checks if a string is a valid palindrome"
      ],
      "history_eval_query": [
        "function that checks if a string is a valid palindrome"
      ],
      "session_length": "medium",
      "text": "Emma: Hi Oliver, it's great to finally meet you. I'm Emma, your mentor here at LEAP. I'll be guiding you through your internship and helping you develop your coding skills.\n\nOliver: Nice to meet you, Emma. I'm excited to be here and looking forward to learning from you.\n\nEmma: Great! Let's get started with some coding best practices. I want you to pay attention to your variable naming conventions. It's important to keep your code consistent and readable. From now on, I need you to end all your variable names with '_wr'. This is a unique convention we use here at LEAP, and it helps us identify and distinguish our code.\n\nOliver: Understood, Emma. I'll make sure to follow this convention from now on.\n\nEmma: Good. Consistency is key in coding, and it's important to develop good habits right from the start. I'll be reviewing your code regularly, so don't hesitate to reach out if you have any questions or concerns.\n\nOliver: Thanks for your guidance, Emma. I'll keep that in mind as I work on my projects. I appreciate your support.\n\nEmma: You're welcome, Oliver. That's what I'm here for. Don't hesitate to reach out if you need any clarification or further assistance. We'll check in regularly to ensure your progress and address any challenges you may encounter.\n\nOliver: Sounds great, Emma. I feel more confident already. I'll make sure to apply this convention consistently."
    }
  ]
}