{
  "context": {
    "mentor": "Juan",
    "mentee": "Luke",
    "company": "INNOVADE",
    "mentor_persona": "[mentor] is a patient and supportive mentor. [mentor] enjoys helping others and sharing their knowledge and experience. [mentor] is always looking for ways to empower and inspire their mentee.",
    "mentee_persona": "[mentee] is a social and outgoing person. [mentee] enjoys working in teams and collaborating with others. [mentee] is always looking for ways to connect with their colleagues and builds strong relationships."
  },
  "instructions": [
    [
      [
        18,
        0
      ],
      [
        46,
        0
      ]
    ]
  ],
  "fillers": [
    111
  ],
  "sessions": [
    {
      "type": [
        "filler-instruction-add",
        "instruction-add",
        "instruction-add"
      ],
      "topic": [
        "never use a pre-commit hook",
        "always include try statements in methods",
        "always include a single digit in variable names"
      ],
      "session_regex": [
        [
          "method try",
          true
        ],
        [
          "variable",
          ".*\\d$"
        ]
      ],
      "history_regex": [
        [
          "method try",
          true
        ],
        [
          "variable",
          ".*\\d$"
        ]
      ],
      "session_eval_query": [
        "Lasso regression class with a train and a predict method",
        "function that computes the mean using an online algorithm"
      ],
      "history_eval_query": [
        "Lasso regression class with a train and a predict method",
        "function that computes the mean using an online algorithm"
      ],
      "session_length": "medium",
      "text": "Juan: Hi, Luke! It's great to finally meet you. I'm Juan, your mentor here at INNOVADE. I understand you're new to the team, so I want to go over some coding standards and practices we follow.\n\nLuke: Nice to meet you too, Juan! I'm excited to be joining the team and I'm looking forward to learning from your experience.\n\nJuan: Great attitude, Luke! One of the things we emphasize here is consistency and adhering to certain coding standards. I want you to avoid using pre-commit hooks in your code. It's a personal preference of mine, and I find it adds unnecessary complexity.\n\nLuke: Understood. I'll make sure to avoid using pre-commit hooks from now on.\n\nJuan: Good. Now, another important practice is to always include try statements in your methods. This helps with error handling and makes your code more robust.\n\nLuke: Alright, I'll keep that in mind. I'll include try statements in all my methods from now on.\n\nJuan: Excellent. Also, we like to use a specific naming convention for variable names. Always include a single digit in your variable names. This makes the code more readable and helps distinguish between similar variables.\n\nLuke: Sure, I can see how that would be helpful. I'll remember to include a single digit in my variable names.\n\nJuan: Great! These practices will help you fit right in with the team. Don't hesitate to reach out if you have any questions or need any help along the way. That's what I'm here for.\n\nLuke: Thanks a lot, Juan. I appreciate your guidance and support. I'm sure I'll have plenty of questions as I get started, so I'll definitely take you up on that offer.\n\nJuan: No problem at all. That's what mentorship is all about. Let's work together to make your contributions to INNOVADE impactful and efficient."
    }
  ]
}