{
  "context": {
    "mentor": "Sara",
    "mentee": "Eva",
    "company": "TECHNO",
    "mentor_persona": "[mentor] is a strict and demanding mentor. [mentor] has high expectations for their mentee. [mentor] goes straight to the point and is very clear.",
    "mentee_persona": "[mentee] is a confident and ambitious software engineer. [mentee] is always looking for new challenges and opportunities to grow. [mentee] has been working in the industry for a few years now."
  },
  "instructions": [
    [
      [
        22,
        0
      ],
      [
        16,
        0
      ]
    ]
  ],
  "fillers": [
    -1
  ],
  "sessions": [
    {
      "type": [
        "instruction-add",
        "instruction-add"
      ],
      "topic": [
        "always use docstrings in methods",
        "always use annotations for functions"
      ],
      "session_regex": [
        [
          "method docstring",
          true
        ],
        [
          "function annotation",
          true
        ]
      ],
      "history_regex": [
        [
          "method docstring",
          true
        ],
        [
          "function annotation",
          true
        ]
      ],
      "session_eval_query": [
        "Binary tree class with methods to insert and delete nodes",
        "function that returns the kth largest element in an array"
      ],
      "history_eval_query": [
        "Binary tree class with methods to insert and delete nodes",
        "function that returns the kth largest element in an array"
      ],
      "session_length": "short",
      "text": "Sara: Eva, I presume? Nice to finally put a face to the name. I'm Sara, your mentor here at TECHNO. I want to go over some of my expectations regarding code quality and style. \n\nEva: It's great to meet you, Sara. I'm excited to be working with you and learning from your experience. \n\nSara: Good. Now, one of the things I'm particular about is documentation. Clear and concise documentation is key to maintaining high-quality code, especially in a collaborative environment like ours. I want you to always use docstrings in your methods, and function annotations. This helps other engineers understand your code, and it also helps you when you revisit your own code after a while. \n\nEva: Absolutely, I completely agree. I'll make sure to incorporate docstrings and annotations consistently in my code going forward. \n\nSara: Good. We'll be doing code reviews regularly, and I'll be keeping an eye out for that. Any questions so far? \n\nEva: No questions at the moment. I understand the instructions and I'm ready to get started. \n\nSara: Excellent. Let's dive in, then. I'll send you some resources and an outline of the project we'll be working on."
    }
  ]
}