{
  "context": {
    "mentor": "Maria",
    "mentee": "David",
    "company": "STARTED",
    "mentor_persona": "[mentor] is a caring and nurturing mentor. [mentor] likes to create a safe and supportive environment for their mentee. [mentor] is always looking for ways to help them grow and develop their skills.",
    "mentee_persona": "[mentee] is a quiet and introverted individual. [mentee] prefers to work alone and is not very comfortable in social situations. [mentee] struggles to communicate their ideas and thoughts to others."
  },
  "instructions": [
    [
      -1
    ],
    [
      [
        44,
        0
      ],
      [
        11,
        7
      ]
    ]
  ],
  "fillers": [
    26,
    -1
  ],
  "sessions": [
    {
      "type": [
        "filler-add"
      ],
      "topic": [
        "Planning team outings and off-site adventures to promote team bonding and relaxation"
      ],
      "session_regex": [],
      "history_regex": [],
      "session_eval_query": [],
      "history_eval_query": [],
      "session_length": "medium",
      "text": "Maria: Hi, David! It's so nice to finally meet you. I'm Maria, your mentor here at STARTED. I hope your first day is going well so far. \n\nDavid: Oh, hi Maria. Nice to meet you too. Yes, it's been a bit overwhelming, but I'm settling in. \n\nMaria: That's great to hear. Starting a new job can be daunting, but we're a friendly bunch, so please don't hesitate to reach out if you need anything. Now, one of the things we like to focus on here at STARTED is team bonding. We find that planning regular team outings and off-site adventures helps to build a strong and relaxed team dynamic. What do you think about that?\n\nDavid: I think that's a great idea. I'm usually more comfortable working alone, but I understand the importance of team bonding. It would be a good opportunity to get to know my colleagues better. \n\nMaria: Exactly! And we try to mix things up with a variety of activities. Sometimes we'll go for a casual hike, other times we might do an escape room or even just a simple team lunch. It's all about giving everyone a chance to relax and connect. \n\nDavid: That sounds fun. I'm not much of an outdoor person, but I'm up for trying new things, especially if it helps me get to know the team better. \n\nMaria: Perfect! I'll make sure to include you in the next outing we plan. In the meantime, if you have any suggestions for activities or places we could visit, feel free to let me know. We're always open to new ideas. \n\nDavid: Sure thing. I'll keep that in mind. Thanks for the offer. \n\nMaria: You're very welcome. Now, why don't I show you around the office? We can start with the engineering team's area and introduce you to some of your colleagues. \n\nDavid: That would be great. I'd like that."
    },
    {
      "type": [
        "instruction-add",
        "instruction-add"
      ],
      "topic": [
        "always add the '@trace_class' decorator from the 'pedantic' module to all classes",
        "always end function names with '_gn'"
      ],
      "session_regex": [
        [
          "class decorator",
          [
            "trace_class",
            true
          ]
        ],
        [
          "function",
          ".*_gn$"
        ]
      ],
      "history_regex": [
        [
          "class decorator",
          [
            "trace_class",
            true
          ]
        ],
        [
          "function",
          ".*_gn$"
        ]
      ],
      "session_eval_query": [
        "Kernel ridge regression class",
        "function that implements merge sort"
      ],
      "history_eval_query": [
        "Kernel ridge regression class",
        "function that implements merge sort"
      ],
      "session_length": "medium",
      "text": "Maria: Good morning, David. How are you today?\n\nDavid: Good morning, Maria. I'm doing well, thank you.\n\nMaria: That's great to hear. Listen, I wanted to go over a few coding conventions that we follow here at STARTED. It's important that we all adhere to these standards to ensure our code is consistent and readable.\n\nDavid: Of course. I'm happy to follow the company's coding conventions.\n\nMaria: Great! Now, for all your Python classes, I want you to add the '@trace_class' decorator from the 'pedantic' module. This helps us with debugging and understanding the flow of our programs.\n\nDavid: Understood. I'll make sure to add the '@trace_class' decorator to all my classes from now on.\n\nMaria: Excellent. Also, when naming your functions, please end the names with '_gn'. This is a convention we use to quickly identify functions within our codebases.\n\nDavid: Noted. I'll remember to end my function names with '_gn'. Are there any other coding standards or conventions I should be aware of?\n\nMaria: That's the main ones for now. Just remember that consistency is key. If you ever have any doubts or questions about our coding standards, don't hesitate to reach out to me or refer to our internal documentation.\n\nDavid: Absolutely, I'll keep that in mind. Thank you for taking the time to go over these instructions with me.\n\nMaria: You're very welcome. It's my pleasure to mentor you and see your progress. Don't hesitate to reach out if you need anything at all. We're a team, and we're here to support each other.\n\nDavid: Thank you, Maria. I really appreciate your guidance and support."
    }
  ]
}